[
 
     {
       "title"    : "Ampersand 2015",
       "url"     : "http://lewisnyman.co.uk/blog/ampersand-2015/",
       "date"     : "November 14, 2015",
       "content"  : "<p>Last week I attended Ampersand Conference in Brighton. As it was just down the road it seemed like a no brainer, but it blew me away. I feel certain it was my favourite conference of the year.</p>\n\n<p>I used to care about typography, a lot. I used to be so passionate about it. In recent years, I&#39;d forgotten to care about it. As I moved toward high level design thinking and UX, component based design, and pattern libraries. It&#39;s easy to forget about the little details.</p>\n\n<p>This conference was all about the little details. The scope was so focused that each talk was a deep dive into the obsessions of the speaker. Each one was a fascinating tale. Watching every speaker care so much reminded me what I used to care about.</p>\n\n<p>The attendees were also brilliant.</p>\n\n<h2>Indra Kupferschmid</h2>\n\n<h3>Down with Web Typography</h3>\n\n<p>Indra is a German Professor and Typographer. She showed us how to apply classic typography principles to the web, how these rules haven&#39;t changed in many years. </p>\n\n<p>It was a great talk for beginners and a nice reminder for experienced designers. </p>\n\n<h2>Marcin Wichary</h2>\n\n<h3>To Hell for Type</h3>\n\n<p>Marcin is a designer and developer working for Medium.</p>\n\n<p>Marcin captivated the entire audience talking about all the terrible sins he has committed all in the name of  a great reading and writing experience on Medium.com. My favourite example was that he <a href=\"https://medium.com/@mwichary/fixing-a-chrome-dictionary-issue-bbd7c5314f01#.o8qmnmgcz\">submitted bug fix to Chromium</a> to prevent smart quotes being flagged as mis-spellings. Other great stories are [The curious case of the disappearing <a href=\"https://medium.com/medium-eng/the-curious-case-of-disappearing-polish-s-fa398313d4df#.x6ma5f8lx\">Polish S</a> and <a href=\"https://medium.com/@mwichary/system-shock-6b1dc6d6596f#.5iamh16hg\">System Shock: a story of a 25-year-old font coming back with a vengeance.</a></p>\n\n<h2>Jen Simmons</h2>\n\n<h3><a href=\"https://speakerdeck.com/jensimmons/modern-layouts-getting-out-of-our-ruts-40-mins\">Modern Layouts: Getting out of our ruts</a></h3>\n\n<p>Jen talked about her impatience with the done-and-done three column layout we see on almost every site. She presented her research into experimental magazine article layouts. This lead her to show us what we can do to push the boundaries of design using modern web standards. It was a great case for art direction on the web and I liked how she covered how to handle this in a CMS, because that&#39;s always an issue.</p>\n\n<h2>Nick Sherman</h2>\n\n<h3>The future of responsive typography</h3>\n\n<p>Nick is on the board of directors for the Type Directors Club, as well as being the co-founder of the excellent <a href=\"http://fontsinuse.com\">Fonts In Use.</a></p>\n\n<p>Nick described the way we select typefaces and weights as being stuck in the past. It&#39;s same way type has been selected and used since movable type was invented. What if there was another way to use type, that&#39;s closer to how we manipulate HTML with CSS?</p>\n\n<p>Nick laid out his ideas of a system that can generate fonts algorithmically. Instead of loading individual font files for each weight or style, you&#39;d load just one, and the browser can use the information to manipulate the display of the type.</p>\n\n<p>This was mind-explodey stuff. It was great to see the thoughts of someone so heavily involved in digital type.</p>\n\n<h2>Bruno Maag</h2>\n\n<h3>Designing typefaces for screens</h3>\n\n<p>Bruno is a Swiss type designer from the type agency <a href=\"https://daltonmaag.com\">Dalton Maag.</a> He presented a fascinating case study on creating the <a href=\"http://typedetail.com/bookerly.html\">Bookerly font</a> for Amazon Kindle. It&#39;s interesting to see how much work and detail goes into designing a typeface. The special considerations that went into e-ink screens was really interesting. I don&#39;t know how someone could design a typeface for so many languages and contexts without going crazy.</p>\n\n<h2>Lu Yu</h2>\n\n<h3><a href=\"https://speakerdeck.com/lugotype/chinese-design-for-westerners\">Chinese Design for Westerners</a></h3>\n\n<p>Lu gave a fantastic talk on how typography and design is handled on the web in China. Think it&#39;s enough to just translate the text? Think again. Different culture, technology, and aesthetics play a part in the design of websites in China.</p>\n\n<p>The average chinese font file contains 20,000+ characters! Weighs between 3–10MB, impossible for web embedding.  </p>\n\n<p>Chinese characters can be really beautiful, emulating the calligraphy style. The presentation inspired me to play around with paint and canvas.</p>\n\n<blockquote class=\"instagram-media\" data-instgrm-captioned data-instgrm-version=\"6\" style=\" background:#FFF; border:0; border-radius:3px; box-shadow:0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width:658px; padding:0; width:99.375%; width:-webkit-calc(100% - 2px); width:calc(100% - 2px);\"><div style=\"padding:8px;\"> <div style=\" background:#F8F8F8; line-height:0; margin-top:40px; padding:50.0% 0; text-align:center; width:100%;\"> <div style=\" background:url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACwAAAAsCAMAAAApWqozAAAAGFBMVEUiIiI9PT0eHh4gIB4hIBkcHBwcHBwcHBydr+JQAAAACHRSTlMABA4YHyQsM5jtaMwAAADfSURBVDjL7ZVBEgMhCAQBAf//42xcNbpAqakcM0ftUmFAAIBE81IqBJdS3lS6zs3bIpB9WED3YYXFPmHRfT8sgyrCP1x8uEUxLMzNWElFOYCV6mHWWwMzdPEKHlhLw7NWJqkHc4uIZphavDzA2JPzUDsBZziNae2S6owH8xPmX8G7zzgKEOPUoYHvGz1TBCxMkd3kwNVbU0gKHkx+iZILf77IofhrY1nYFnB/lQPb79drWOyJVa/DAvg9B/rLB4cC+Nqgdz/TvBbBnr6GBReqn/nRmDgaQEej7WhonozjF+Y2I/fZou/qAAAAAElFTkSuQmCC); display:block; height:44px; margin:0 auto -44px; position:relative; top:-22px; width:44px;\"></div></div> <p style=\" margin:8px 0 0 0; padding:0 4px;\"> <a href=\"https://www.instagram.com/p/-cHL5EzSm4/\" style=\" color:#000; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:normal; line-height:17px; text-decoration:none; word-wrap:break-word;\" target=\"_blank\">First go at Chinese writing turned out a bit crap as expected. It was nice to focus on one small thing though.</a></p> <p style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; line-height:17px; margin-bottom:0; margin-top:8px; overflow:hidden; padding:8px 0 7px; text-align:center; text-overflow:ellipsis; white-space:nowrap;\">A photo posted by Lewis Nyman (@lewisnyman) on <time style=\" font-family:Arial,sans-serif; font-size:14px; line-height:17px;\" datetime=\"2015-11-23T19:34:59+00:00\">Nov 23, 2015 at 11:34am PST</time></p></div></blockquote>\n\n<script async defer src=\"//platform.instagram.com/en_US/embeds.js\"></script>\n\n<h2>Matthew Young</h2>\n\n<h3>Designing Pelican Books</h3>\n\n<p>Matthew Young is a book cover designer working for Penguin. As a huge fan Penguin books I consumed this presentation with the wide eyes of a child. </p>\n\n<p>Matthew spoke about the design objectives and process behind the relaunch of Pelican Books. It was a great example a well designed modern business model for books with classic aesthetics. </p>\n\n<h2>Sarah Hyndman</h2>\n\n<h3>Think outside the font</h3>\n\n<p>Sarah runs <a href=\"http://www.typetasting.com/\">Type Tasting,</a> which investigates ways type influences our perception and decision making. If you&#39;ve ever had a colleage or client ask you if a custom typeface is really worth the effort, I&#39;d advise you to play one of Sarah&#39;s games with them.</p>\n\n<p>She&#39;s invented some really fun, interactive ways of showing people the power of the right type. <a href=\"https://www.youtube.com/watch?v=OXc-VZ4Vwbo\">Watch her TED talk.</a></p>\n\n<p>All in all, I&#39;ve so glad I went. I felt like I gave me a lot to think about be be excited about!</p>\n"
     } ,
 
     {
       "title"    : "Pre-ampersand Conf",
       "url"     : "http://lewisnyman.co.uk/blog/pre-ampersand-conf/",
       "date"     : "November 12, 2015",
       "content"  : "<p>Whoops! Turns out you shouldn&#39;t write a blog title “Writing Again”. That&#39;s a bit of a jinx and it means you won&#39;t write again for another three months.</p>\n\n<p>I&#39;ve had a good week this week. A fair amount of designing without development. More than I expected to do and more than I&#39;ve done in a long time which is a nice surprise. </p>\n\n<p>Tomorrow is <a href=\"http://2015.ampersandconf.com\">Ampersand Conf 2015.</a> I had a good chat with some of the attendees over a burger and beers and I&#39;m looking forward to it.</p>\n\n<p>Best keep it short and sweet. In case I use up my writing juices for another three months.</p>\n\n<p>Chao!</p>\n"
     } ,
 
     {
       "title"    : "Thanks Hybrid",
       "url"     : "http://lewisnyman.co.uk/blog/writing-again/",
       "date"     : "August 24, 2015",
       "content"  : "<p>It&#39;s been a while since I&#39;ve written here. The trip to Minneapolis in June threw my mojo off and once I lost my routine it became easy to not write.</p>\n\n<p>Loads has happened in the past two months! I spoke at <a href=\"http://drupalcampnorth.org/\">Drupal Camp North,</a> I sprinted on Drupal 8 at <a href=\"https://groups.drupal.org/node/474418\">Wunderkraut Munich.</a> I just got back from Dublin where I attended the last excellent <a href=\"hybridconf.net\">HybridConf.</a> It was a common theme of conversation how much the conference would be missed.</p>\n\n<p>I&#39;m going to miss Hybrid, like <a href=\"http://2013.buildconf.com/\">Build,</a> and <a href=\"http://newadventuresconf.com/\">New Adventures in Web Design</a> before it. It feels like a friendly home, and it&#39;s really hard to pull that off.</p>\n\n<p>I hope we find a way of producing this kind of conference without expecting someone to burn out or lose money year-on-year.</p>\n"
     } ,
 
     {
       "title"    : "Moving from Github pages to self hosted Jekyll",
       "url"     : "http://lewisnyman.co.uk/blog/moving-from-github-pages-to-self-hosted-jekyll/",
       "date"     : "July 17, 2015",
       "content"  : "<p>Last year I <a href=\"/blog/hello-jekyll/\">migrated this site to Jekyll.</a> One of the reasons was I really didn&#39;t want to worry about my own server, and the option was there to use Github pages for free.</p>\n\n<p>I have a custom build process for my site, using Grunt. This meant I couldn&#39;t take full advantage of the automated build process of Github pages. I built the site on my local machine and used <a href=\"https://github.com/robwierzbowski/grunt-build-control\">grunt-build-control</a> to deploy this to a <a href=\"https://github.com/lewisnyman/lewisnyman.github.io\">separate github repo.</a> Not pretty but it works.</p>\n\n<p>Recently, I&#39;ve been feeling the need to own my server again. It&#39;s a pain having to build on my own machine, meaning I&#39;m tied to it for creating content.</p>\n\n<p>As I want to <a href=\"(/blog/indie-web-camp-2015/)\">move towards publishing more content</a> on this site I need to make it more flexible. I thought about introducing support for <a href=\"http://indiewebcamp.com/note\">notes</a> and <a href=\"http://indiewebcamp.com/micropub\">micropub</a> and realised that having an automated build process was a blocker.</p>\n\n<p>I also want to start pulling in all my data from other services I use and maybe doing something cool (eg. <a href=\"https://gyrosco.pe\">gyrosco.pe</a>) . To do that, I&#39;m going to need a persistent server somewhere storing and serving data.</p>\n\n<p>This was my process:</p>\n\n<ol>\n<li>Install Nginx and setup a folder that serves HTML from test.lewisnyman.co.uk (for now)</li>\n<li>Install build dependencies (RVM, NPM, Bundler, Sinatra, etc)</li>\n<li>Create a build script that runs a Sinatra server, nginx forwards all requests to api.lewisnyman.co.uk to there.</li>\n<li>Setup the Github webhook to hit the api endpoint on push</li>\n<li>Debug the sinatra script for an hour</li>\n</ol>\n\n<p>I&#39;m happy to put the build script on github once it&#39;s tested and I know it&#39;s secure. It&#39;s very similar to the one in the tutorial <a href=\"http://petemichaud.github.io/2013/09/05/multisite-server-jekyll-digitalocean.html\">Automagic Multisite Server with Jekyll and Nginx on a DigitalOcean Droplet</a> but with less abstraction to keep it simple.</p>\n\n<p>I used these tutorials and documentation to help me set up the Digital Ocean droplet and the build process. I want to write this up in more detail as simple tutorial for newbies.</p>\n\n<p>Special thanks to the lovely <a href=\"https://twitter.com/joesb\">Joe Baker</a> for giving me some pointers.</p>\n\n<ul>\n<li><a href=\"https://www.digitalocean.com/community/tutorials/how-to-install-nginx-on-centos-7\">How To Install Nginx on CentOS 7</a></li>\n<li><a href=\"http://nginx.org/en/docs/beginners_guide.html\">Nginx beginners guide</a></li>\n<li><a href=\"http://petemichaud.github.io/2013/09/05/multisite-server-jekyll-digitalocean.html\">Automagic Multisite Server with Jekyll and Nginx on a DigitalOcean Droplet</a></li>\n<li><a href=\"https://www.digitalocean.com/community/tutorials/how-to-install-node-js-on-a-centos-7-server\">How To Install Node.js on a CentOS 7 server</a></li>\n<li><a href=\"https://rvm.io/rvm/install\">Installing RVM</a></li>\n<li><a href=\"http://www.sinatrarb.com/documentation.html\">Sinatra documentation</a></li>\n<li><a href=\"https://jonathanstark.com/blog/deploying-code-automatically-with-github-webhooks\">Deploying Automatically with Github WebHooks</a></li>\n<li><a href=\"https://developer.github.com/webhooks/\">Github webhooks</a></li>\n</ul>\n"
     } ,
 
     {
       "title"    : "Indie Web Camp 2015",
       "url"     : "http://lewisnyman.co.uk/blog/indie-web-camp-2015/",
       "date"     : "July 15, 2015",
       "content"  : "<p>Last Saturday I attended my first <a href=\"https://indiewebcamp.com/2015/Brighton\">Indie Web Camp.</a> I&#39;ve been using this site a lot more recently and I&#39;ve been really excited to improve and add to it. I like the idea of owning my own data, but it&#39;s always felt like a mammoth task to real in all the services I rely on. </p>\n\n<p>I run my site on Jekyll, it felt like a big barrier to getting my data in and out of the static site.</p>\n\n<p>I found a fellow ex-gowalla user in <a href=\"https://adactio.com\">Jeremy</a> and we briefly lamented the <a href=\"http://www.quora.com/Where-did-my-Gowalla-data-go\">lack of data export</a> years after the <a href=\"http://blog.gowalla.com/\">Facebook acquisition.</a></p>\n\n<p>I learned a lot about the <a href=\"https://indiewebcamp.com/Principles\">principles of the Indie Web movement,</a> and how to achieve this using <a href=\"https://indiewebcamp.com/POSSE\">POSSE,</a> <a href=\"https://indiewebcamp.com/PESOS\">PESOS,</a> and <a href=\"https://indiewebcamp.com/backfeed\">Backfeed.</a></p>\n\n<p>I also found out about <a href=\"http://indiewebify.me/\">IndieWebify.Me,</a> a step-by-step guide to owning your own data. This felt achievable! I no longer felt intimidated.</p>\n\n<p>I using the validation tools I realised my login links did work as expected. <a href=\"https://github.com/lewisnyman/lewisnyman.co.uk-source/commit/b1c7bf17f6e278e35ccbfd79cd22c210073e10bd\">I added invisible links in the head of every page.</a></p>\n\n<p>At the end of the day we went for a drink and I introduced a few people to Burger Brothers. That&#39;s always enjoyable.</p>\n\n<p>The Sunday was the hack day, which I missed because I was up in London hanging out with family. I did get a chance to work on my site a little, and luckily for me there were other attendees who were running Jekyll sites I could learn from as they were working through the same problems I was.</p>\n\n<p>Thanks to <a href=\"http://benjamin.parry.is/writing/testing-webmentions/\">Benjamin Parry</a> and <a href=\"https://paulrobertlloyd.com/2015/07/webmentions\">Paul Robert Lloyd</a> for working out in the open, <a href=\"https://github.com/lewisnyman/lewisnyman.co.uk-source/issues/12\">enabling my own attempts at implementing Webmentions</a>.</p>\n\n<p>If I&#39;ve done this correctly, they should receive a webmention on their site.</p>\n"
     } ,
 
     {
       "title"    : "Shifting from conflict to learning",
       "url"     : "http://lewisnyman.co.uk/blog/shifting-from-conflict-to-learning/",
       "date"     : "July 07, 2015",
       "content"  : "<p>I&#39;ve started reading <a href=\"http://www.amazon.co.uk/gp/product/0670921343/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=19450&amp;creativeASIN=0670921343&amp;linkCode=as2&amp;tag=lewisnymancou-21&amp;linkId=62KFSUTSNRZHMVJP\">Difficult Conversations: How to Discuss What Matters Most.</a> I&#39;m a quarter of the way through andI already want to recommend this book to everyone I&#39;ve ever met or will meet.</p>\n\n<p>One concept that applies situations of conflict is shifting &#39;learning mode&#39;. Bare in mind that both parties usually think they are the ones who are in the right. You put aside your perspective of right and wrong and dig deeper into the &#39;why&#39; of someones actions. Instead of making judgments on someones character, you find out why they acted like they did and how the situation looks from their perspective.</p>\n\n<h2>Move from certainty to curiosity</h2>\n\n<blockquote>\n<p>Instead of asking yourself “How can they think that?!” ask yourself, “I wonder what information they have that I don&#39;t?”</p>\n\n<p>Instead of asking “How can they be so irrational?” ask “How might they see the world in which their view makes sense?”</p>\n</blockquote>\n\n<p>If you accept both perspectives, and remove the idea that only one can be the right and the other wrong, you accept the fact that two people can have different experiences and thoughts. You can move forward together instead of butting heads.</p>\n\n<p>Next time I catch myself thinking “Who&#39;s wrong or right here?” I&#39;m going to make more effort to listen and accept both perspectives of the story.</p>\n"
     } ,
 
     {
       "title"    : "Increase your chances of speaking at Drupalcon with an english session recording.",
       "url"     : "http://lewisnyman.co.uk/blog/increase-your-chances-of-speaking-at-drupalcon-with-english-session-recording/",
       "date"     : "July 02, 2015",
       "content"  : "<p>Today I was replying to a request for feedback for a rejected DrupalCon session submission in the frontend track.</p>\n\n<p>Here&#39;s a snippet of general advice for any speaker for whom english is a second language:</p>\n\n<blockquote>\n<p>We couldn&#39;t find any videos that demonstrated your english presentation skills. As DrupalCon is an english speaking conference, it&#39;s really important that we can assess this. Picking a speaker without any video examples is very risky for a track chair.</p>\n\n<p>I would definitely look for english speaking camps that are recording video to help your chances of speaking at DrupalCon in the future. Maybe if a camp asks you to speak you can ask them about recording the session on video as a bargaining chip? ;-)</p>\n</blockquote>\n\n<p>Camps that record their sessions are providing a valuable service to the community and to their speakers. We should encourage them by giving them better speakers.</p>\n"
     } ,
 
     {
       "title"    : "A week in Minneapolis",
       "url"     : "http://lewisnyman.co.uk/blog/a-week-in-minneapolis/",
       "date"     : "June 29, 2015",
       "content"  : "<p>It&#39;s been nine days since I&#39;ve written here. I can&#39;t remember having a spare five minutes the whole week when I didn&#39;t went to head straight to sleep.</p>\n\n<p>What a week! After flying in on Sunday, Ivan took me on a bicycle tour of Minneapolis to keep jet lag away. It was perfect weather and barely any traffic. The lakes just west of Minneapolis are glorious.</p>\n\n<blockquote class=\"instagram-media\" data-instgrm-version=\"4\" style=\" background:#FFF; border:0; border-radius:3px; box-shadow:0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width:658px; padding:0; width:99.375%; width:-webkit-calc(100% - 2px); width:calc(100% - 2px);\"><div style=\"padding:8px;\"> <div style=\" background:#F8F8F8; line-height:0; margin-top:40px; padding:50% 0; text-align:center; width:100%;\"> <div style=\" background:url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACwAAAAsCAMAAAApWqozAAAAGFBMVEUiIiI9PT0eHh4gIB4hIBkcHBwcHBwcHBydr+JQAAAACHRSTlMABA4YHyQsM5jtaMwAAADfSURBVDjL7ZVBEgMhCAQBAf//42xcNbpAqakcM0ftUmFAAIBE81IqBJdS3lS6zs3bIpB9WED3YYXFPmHRfT8sgyrCP1x8uEUxLMzNWElFOYCV6mHWWwMzdPEKHlhLw7NWJqkHc4uIZphavDzA2JPzUDsBZziNae2S6owH8xPmX8G7zzgKEOPUoYHvGz1TBCxMkd3kwNVbU0gKHkx+iZILf77IofhrY1nYFnB/lQPb79drWOyJVa/DAvg9B/rLB4cC+Nqgdz/TvBbBnr6GBReqn/nRmDgaQEej7WhonozjF+Y2I/fZou/qAAAAAElFTkSuQmCC); display:block; height:44px; margin:0 auto -44px; position:relative; top:-22px; width:44px;\"></div></div><p style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; line-height:17px; margin-bottom:0; margin-top:8px; overflow:hidden; padding:8px 0 7px; text-align:center; text-overflow:ellipsis; white-space:nowrap;\"><a href=\"https://instagram.com/p/4P9hqETSll/\" style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:normal; line-height:17px; text-decoration:none;\" target=\"_top\">A photo posted by Lewis Nyman (@lewisnyman)</a> on <time style=\" font-family:Arial,sans-serif; font-size:14px; line-height:17px;\" datetime=\"2015-06-22T23:11:19+00:00\">Jun 22, 2015 at 4:11pm PDT</time></p></div></blockquote>\n\n<p>Monday was a nice, Bojhan and I settled in and visited the Mall of America, which has a pretty impressive Lego store.</p>\n\n<p><img src=\"https://photos-4.dropbox.com/t/2/AADm78YvKP-zgUBgYAEvHUXKZV_lmWniFcSMp-WcHwCt0g/12/1646407/jpeg/2048x1536/3/_/1/2/2015-06-22%2014.31.52.jpg/EPuCrAEYyuXtRCABKAE/3-HNJXQXn82tN3OFx_fqC3ScmukmgiC3vMcunqb-sUY\" alt=\"The lego shop roof\" /></p>\n\n<p>We also had a chance to walk along the Mississippi river and past the historic flour mills.</p>\n\n<blockquote class=\"instagram-media\" data-instgrm-version=\"4\" style=\" background:#FFF; border:0; border-radius:3px; box-shadow:0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width:658px; padding:0; width:99.375%; width:-webkit-calc(100% - 2px); width:calc(100% - 2px);\"><div style=\"padding:8px;\"> <div style=\" background:#F8F8F8; line-height:0; margin-top:40px; padding:50% 0; text-align:center; width:100%;\"> <div style=\" background:url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACwAAAAsCAMAAAApWqozAAAAGFBMVEUiIiI9PT0eHh4gIB4hIBkcHBwcHBwcHBydr+JQAAAACHRSTlMABA4YHyQsM5jtaMwAAADfSURBVDjL7ZVBEgMhCAQBAf//42xcNbpAqakcM0ftUmFAAIBE81IqBJdS3lS6zs3bIpB9WED3YYXFPmHRfT8sgyrCP1x8uEUxLMzNWElFOYCV6mHWWwMzdPEKHlhLw7NWJqkHc4uIZphavDzA2JPzUDsBZziNae2S6owH8xPmX8G7zzgKEOPUoYHvGz1TBCxMkd3kwNVbU0gKHkx+iZILf77IofhrY1nYFnB/lQPb79drWOyJVa/DAvg9B/rLB4cC+Nqgdz/TvBbBnr6GBReqn/nRmDgaQEej7WhonozjF+Y2I/fZou/qAAAAAElFTkSuQmCC); display:block; height:44px; margin:0 auto -44px; position:relative; top:-22px; width:44px;\"></div></div><p style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; line-height:17px; margin-bottom:0; margin-top:8px; overflow:hidden; padding:8px 0 7px; text-align:center; text-overflow:ellipsis; white-space:nowrap;\"><a href=\"https://instagram.com/p/4gJ5_CzSsy/\" style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:normal; line-height:17px; text-decoration:none;\" target=\"_top\">A photo posted by Lewis Nyman (@lewisnyman)</a> on <time style=\" font-family:Arial,sans-serif; font-size:14px; line-height:17px;\" datetime=\"2015-06-29T06:07:21+00:00\">Jun 28, 2015 at 11:07pm PDT</time></p></div></blockquote>\n\n<p><img src=\"https://photos-3.dropbox.com/t/2/AACWqFx5TmJeOQ-KtvHYYTMAHKwn85ygyOzH7_0OCgyfMw/12/1646407/jpeg/2048x1536/3/_/1/2/2015-06-22%2015.24.05.jpg/EPuCrAEYyuXtRCABKAE/G6RhTowFciNzv310AI4objSQiyMl0-IiwYOHWG-mAAY%2C-Bmjhq0MFaumWGcQG97FeMmezi1hAjW0VlyWPGvgDwQ\" alt=\"A view of the Mississippi river\" /></p>\n\n<p>Tuesday was the beginning of the usability study. It was a full day of observation and analysis. In the evening Ivan took us to watch a Minnesota Twins baseball game. It was exciting and really filling. Fun!</p>\n\n<p><img src=\"https://photos-1.dropbox.com/t/2/AADgUqHDaSIisYNod4gfNxPFcUsEEK3LNSar9RbQPkqdFw/12/1646407/jpeg/2048x1536/3/_/1/2/2015-06-22%2019.29.59.jpg/EPuCrAEYyuXtRCABKAE/tw2-TuW45-85o4XAZCHaZQkjQ5V0tw_VHsDpGamot7g\" alt=\"Me, Bojhan, and Ivan at the baseball\" /></p>\n\n<p>Wednesday was another early start with another full day of observation. It was great to watch Nick and Joe from the University work and collaborate with everyone in the room.</p>\n\n<p>On Thursday, we analysed and prioritised all the issues we found during the previous two days. 140 issues! This took a really long time...</p>\n\n<p>Friday, the camp started and everyone but me had presentations to give. I spent a good amount of time working on the Saturday presentation on the results of the usability study. I also watched Todds keynote again, and I loved it just as much as when I saw it in Bogota.</p>\n\n<p>Saturday, we had a presentation to give. We were tweaking the slides up until the session was due to start! I&#39;m not very comfortable sharing the stage with others and I wasn&#39;t used to using Google Drive to present. Even so it went surprisingly well! It was great to present alongside Angie, Bojhan, Ivan, Link, and Nick. I&#39;m glad Nick made it to the camp, as he&#39;s so full of energy and valuable advice. After the presentation we could finally relax a little :-)</p>\n\n<p>Sunday? Sprinting! Another early start. We spent the first hour or so finishing up the issues spreadsheet and then spent what little time we had discussing any tricky issues with people in the room.</p>\n\n<p>I wish I had time to write up each day separately but at least I dumped it out of my head before I land in Zürich and back to normal work life.</p>\n\n<script async defer src=\"//platform.instagram.com/en_US/embeds.js\"></script>\n"
     } ,
 
     {
       "title"    : "Flying to Minneapolis tomorrow",
       "url"     : "http://lewisnyman.co.uk/blog/flying-to-minneapolis-tomorrow/",
       "date"     : "June 20, 2015",
       "content"  : "<p>Tomorrow I&#39;ll be catching a flight to Minneapolis, via Amsterdam. The total travel time is over ten hours, so I&#39;m brainstorming something to be productive with on the trip.</p>\n\n<p>I&#39;m eager to finish <a href=\"http://www.amazon.co.uk/gp/product/B00HVPSXNS/ref=as_li_tl?ie=UTF8&camp=1634&creative=19450&creativeASIN=B00HVPSXNS&linkCode=as2&tag=lewisnymancou-21&linkId=NGNBPJH7E3TMR627\">One Hundred Years of Solitude</a> or maybe start reading <a href=\"http://www.amazon.co.uk/gp/product/0670921343/ref=as_li_tl?ie=UTF8&camp=1634&creative=19450&creativeASIN=0670921343&linkCode=as2&tag=lewisnymancou-21&linkId=62KFSUTSNRZHMVJP\">Difficult Conversations: How to Discuss What Matters Most.</a> I&#39;ve also been hacking around with Wunderkraut&#39;s <a href=\"https://hubot.github.com/\">hubot</a> instance. We affectionately named him <a href=\"https://github.com/WunderRoot/cato\">cato.</a></p>\n\n<p>I&#39;m also really looking forward to improving this site. Now that I&#39;m using it more and more people are visiting it, it feels like a higher priority to me now.</p>\n"
     } ,
 
     {
       "title"    : "Weight loss lessons",
       "url"     : "http://lewisnyman.co.uk/blog/weight-loss-lessons/",
       "date"     : "June 19, 2015",
       "content"  : "<p>Today I read an <a href=\"http://www.loopinsight.com/2015/06/18/follow-up-to-how-i-lost-over-40-pounds-using-healthkit-and-apple-watch/\">inspiring blog post</a> by Jim Dalrymple, of <a href=\"http://www.loopinsight.com/\">The Loop.</a></p>\n\n<p>He wrote about his weight loss of fourty pounds over ten months, which is pretty incredible. For someone who admitted he never though about fitness before now, he has a great attitude. Here are the lessons I&#39;ve learnt.</p>\n\n<h2>Become aware of everything you eat</h2>\n\n<p>Once you understand what your putting in your mouth, you become so much more aware of the decisions you make. Myfitnesspal does a great job at this, not just telling you your calories, but your sodium, protein, carbohydrates, and more. You quickly realise that some foods that are &#39;healthy&#39; really aren&#39;t. That salad would be healthy... if it wasn&#39;t covered in french dressing.</p>\n\n<h2>Don&#39;t become obsessed</h2>\n\n<blockquote>\n<p>Using MyFitnessPal is an approximation of the food I’m eating every day. I don’t count the number of strawberries I eat, I just say, “Yeah, that’s about a quarter of a cup.”</p>\n</blockquote>\n\n<h2>One day at a time</h2>\n\n<p>I looked at each day in tenths of pounds. If I was down by even one-tenth, that was great for me. If I was up, I looked at what I did the day before that may of caused it. I didn’t feel guilty or beat myself, I just tried to do better.</p>\n\n<h2>Good days and bad days</h2>\n\n<blockquote>\n<p>All I wanted to do is try. Every single day. I’ll have some good days and some bad days, but I didn’t care, I’d just try.</p>\n</blockquote>\n"
     } ,
 
     {
       "title"    : "Exporting from moves to Myfitnesspal",
       "url"     : "http://lewisnyman.co.uk/blog/exporting-from-moves-to-myfitnesspal/",
       "date"     : "June 18, 2015",
       "content"  : "<p>I&#39;ve been using <a href=\"https://www.moves-app.com/\">Moves</a> constantly for two and a half years, mainly because you don&#39;t have to do anything to use it. Not even open the app.</p>\n\n<p>It&#39;s a free pedometer/calorie counter, and it has the added benefit of not needing to be &#39;turned on&#39; when you&#39;re going to a run or a cycle. It logs everything.</p>\n\n<p>I&#39;ve also been using <a href=\"myfitnesspal.com\">Myfitnesspal</a> on and off. It&#39;s really good at tracking calories ingested, containing a huge database of food information.</p>\n\n<p>What I really wanted was for the burned calories logged in Moves to be deducted from my ingested calories in Myfitnesspal. It&#39;s possible, but not without a bit of fiddling.</p>\n\n<p>Moves connects with <a href=\"https://apps.moves-app.com/\">several apps,</a> one being <a href=\"http://www.moves-export.com/\">Moves Export.</a> Moves export is pretty cool in itself, it allows you to automatically checkin to Foursquare and export GPS and JSON. It can also post directly to <a href=\"http://runkeeper.com\">Runkeeper.</a></p>\n\n<p>Runkeeper is the link between the two apps, Moves Export posts to Runkeeper, and <a href=\"https://www.myfitnesspal.com/apps/show/102\">Runkeeper connects with Myfitnesspal.</a></p>\n\n<p>Once you have that chain setup, voilà. You have automatic fitness tracking from Moves to Myfitnesspal.</p>\n"
     } ,
 
     {
       "title"    : "Advice on giving advice",
       "url"     : "http://lewisnyman.co.uk/blog/advice-on-giving-advice/",
       "date"     : "June 16, 2015",
       "content"  : "<p>The other day I listened to an episode of <a href=\"https://friendshipping.simplecast.fm\">Friendshipping,</a> a podcast about friendship and how to be a good friend.</p>\n\n<p><a href=\"https://friendshipping.simplecast.fm/episodes/12810-advice-on-giving-advice\">The episode was about giving advice</a> and it was great for me. I&#39;m someone who can&#39;t help but open their mouth to “help”, even when advice was never asked for.</p>\n\n<p>Part of the discussion was asking for permission before giving advice. Not “Can I give you some advice?” because that sounds condescending. It&#39;s better to say &quot;Let me know if you want some feedback, I&#39;d be happy to help&quot;.</p>\n\n<p>Isn&#39;t that brilliant? Learning to be a better person is fun.</p>\n"
     } ,
 
     {
       "title"    : "Swimming in the Limmat and Kafi Duzis",
       "url"     : "http://lewisnyman.co.uk/blog/swimming-in-the-limmat-and-kafi-duzis/",
       "date"     : "June 14, 2015",
       "content"  : "<p>Last night our neighbors had a party that lasted until 7am. Fuck them.</p>\n\n<p>Despite that ruining the morning, I had a great day. I helped Emma get Jekyll up and running on her local so she could play around with her personal site. I also drew a few wireframes based on her content requirements to get her started.</p>\n\n<p>Then I went running with my Vibrams, tri-shorts, and a waterproof bag to stash my gear. I ran and swam up and down the Limmat river. It&#39;s my favourite summer past time in Zürich.</p>\n\n<p>Then I raced Josef to <a href=\"http://www.kafiduzis.ch/\">Kafi Duzis</a> where they had a bad and an awesome live band playing. The heavens opened but that didn&#39;t stop the fun.</p>\n"
     } ,
 
     {
       "title"    : "A weekend in Zürich",
       "url"     : "http://lewisnyman.co.uk/blog/a-weekend-in-zurich/",
       "date"     : "June 13, 2015",
       "content"  : "<p>Finally after being out of the country for so long and moving flat in the weekends inbetween we had a chance to spend time in Zürich.</p>\n\n<p>The weather defied the predictions and instead of being wet it was glorious! We cycled around Zürich picking up some goods for the flat (mostly hangers), some food to cook in the coming days, and a Fitbit Aria Wifi scale to help loose some of that fat that built up over the weeks of drinking and dining in the USA.</p>\n\n<p>After that, catching up on Game of Thrones. More Tyrion Lanister please!</p>\n\n<p>And more wine!</p>\n"
     } ,
 
     {
       "title"    : "Drupal 8 frontend SMACSS",
       "url"     : "http://lewisnyman.co.uk/blog/drupal-8-frontend-smacss/",
       "date"     : "June 12, 2015",
       "content"  : "<p>I spent most of today working on <a href=\"https://www.drupal.org/project/issues/search?text=&amp;projects=Drupal%20core&amp;assigned=&amp;submitted=&amp;project_issue_followers=&amp;status%5BOpen%5D=Open&amp;&amp;&amp;issue_tags_op=%3D&amp;issue_tags=frontend\">Drupal 8 frontend issues.</a> Most of the day was spent on <a href=\"https://www.drupal.org/node/2395853\">Split system.module.css and system.theme.css files into SMACSS style components</a> which is a huge issue that will have a great affect on the frontend of Drupal 8.</p>\n\n<p>The files system.module.css (449 lines) and system.theme.css (604 lines) in Drupal contain most of the shared styling across all the functionality in Drupal. Menus, messages, buttons, tabs, etc, etc.</p>\n\n<p>By splitting them all up into their individual files, themers will have a lot more control over what does or doesn&#39;t get loaded, and when it gets loaded. Win!</p>\n\n<p>The main reason I want to do it is maintainability, it&#39;s really difficult to pick through these massive files to figure our what is going on or where some styling lives. It also makes it a lot easier to tidy up a file if it&#39;s only 20 lines instead of a 600 line monster.</p>\n\n<p>Beyond Drupal 8, this opens up even more opportunities. We can start thinking about markup templates, CSS, and JavaScript as bundled components. It will be exciting to see where this leads.</p>\n"
     } ,
 
     {
       "title"    : "Fire the workaholics",
       "url"     : "http://lewisnyman.co.uk/blog/fire-the-workaholics/",
       "date"     : "June 11, 2015",
       "content"  : "<blockquote>Workaholics aren't heroes. They don't save the day, they just use it up. The real hero is home because she figured out a faster way</blockquote>\n\n<p>Since reading <a href=\"http://37signals.com/rework/\">Rework</a> five years ago, one of the chapters that keeps bubbling up into my mind is <a href=\"https://signalvnoise.com/posts/902-fire-the-workaholics\">Fire the workaholics</a>.</p>\n\n<p>Sadly, this is because I still see too many workaholics who are so influential in their own company that they really should know better. What you do in your company sets expectations and it sets the foundation of the the culture of the company.</p>\n\n<p>If you have the power to set the culture of a company, please be responsible.</p>\n"
     } ,
 
     {
       "title"    : "Drupalcon frontend track",
       "url"     : "http://lewisnyman.co.uk/blog/drupalcon-frontend-track/",
       "date"     : "June 10, 2015",
       "content"  : "<p>Today I began looking over the session submission for the frontend track of Drupalcon Barcelona. There are some impressive looking talks with a good variety. I&#39;m excited for the conference already and I haven&#39;t even finished going through them all.</p>\n\n<p>Today was also about settling back in to life in Zürich. I went for a decent run, with 100+ squats halfway through. I  think I&#39;ll struggle to walk tomorrow!</p>\n\n<p>I also booked my flights to Minneapolis on the 21st. I&#39;ll be helping run the Drupal 8 usability test there, as well as helping run the sprints during Drupalcamp Twin Cities.</p>\n"
     } ,
 
     {
       "title"    : "Back in Zürich",
       "url"     : "http://lewisnyman.co.uk/blog/back-in-zurich/",
       "date"     : "June 09, 2015",
       "content"  : "<p>Last night I flew back to Zürich after a month away either in the UK or the USA. I forgot what it was like to relax, never being far from a backpack I have to rifle through to find my what I need for the day.</p>\n\n<p>I&#39;ve gotten pretty good at packing, but I think that&#39;s allowed me to take more then I really need on trips. If I want to be able to live anywhere in the future I need to shed more weight from around me, and learn to maintain a routine when everything else is changing.</p>\n"
     } ,
 
     {
       "title"    : "Company identity vs collective identity",
       "url"     : "http://lewisnyman.co.uk/blog/company-identity-vs-collective-identity/",
       "date"     : "June 08, 2015",
       "content"  : "<p>In <a href=\"https://www.youtube.com/watch?v=EJlm58wZCUM\">Bogota,</a> Todd spoke about the idea of a company culture that either focused on the company or focused on the people within.</p>\n\n<p>When we refer to the needs of “the company” who are we really talking about? When I&#39;ve worked in organisations with a strong heriachy, where reference to the needs and objectives of the company are basically the needs of management. When working in flatter organisations, I rarely hear a reference to the needs of “the company”. There are more “we”s and “I”s.</p>\n\n<p>Now, I listen out for “the company”  as a culture smell, a sign of people&#39;s needs being overriden by management.</p>\n"
     } ,
 
     {
       "title"    : "A Birthday and a leaving party",
       "url"     : "http://lewisnyman.co.uk/blog/birthday-leaving-party/",
       "date"     : "June 07, 2015",
       "content"  : "<p>OK so I didn&#39;t blog for the past two days. I&#39;ve had two full days. It&#39;s more important not to fall than not to stumble.</p>\n\n<p>Saturday involved a trip to the <a href=\"http://eorailway.co.uk/\">Epping Railway</a> and a trip though the lovely countryside for my Dad&#39;s birthday. The evening involved rushing to see of my good friend <a href=\"http://samdransfield.tumblr.com/\">Sam,</a> who&#39;s leaving England to ply his trade on the west coast, Los Angeles. I&#39;ll miss him.</p>\n\n<p>Sunday involved a hungover shamble around Brighton for Breakfast in Kemptown, an ice cream at <a href=\"https://foursquare.com/v/marroccos/4ba4f456f964a52009c838e3\">Marrocoo&#39;s,</a> and a swim in the sea. Not a bad end to the week.</p>\n"
     } ,
 
     {
       "title"    : "The Flophouse",
       "url"     : "http://lewisnyman.co.uk/blog/the-flophouse/",
       "date"     : "June 04, 2015",
       "content"  : "<p>Since the turn of the year I&#39;ve been listening obsessively to The Flophouse. It&#39;s a podcast where three friends watch a bad movie and then talk about it. It is hilarious. If you&#39;re thinking along the lines of &quot;Mystery Science Theater 3000&quot; you&#39;re not far off.</p>\n\n<p>The trio of friends: Elliot, Stuart, and Dan, have great chemistry and a tendency for comedy improv. Two of the hosts are also comedy writers, and use their knowledge of writing to rip the movies to shreds. It was a permanent fixture during our roadtrip through America.</p>\n\n<p>My recommended episodes are:</p>\n\n<ul>\n<li><a href=\"http://www.flophousepodcast.com/2012/04/episode-100-tango-cash/\">Episode #100 – Tango &amp; Cash</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2013/08/episode-133-bullet-to-the-head/\">Episode #133 – Bullet to the Head</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2015/03/episode-174-that-awkward-moment/\">Episode #174 – That Awkward Moment</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2014/06/episode-155-last-vegas/\">Episode #155 – Last Vegas</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2014/05/episode-153-g-i-joe-retaliation/\">Episode #153 – G.I. Joe: Retaliation</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2014/03/episode-148-gangster-squad/\">Episode #148 – Gangster Squad</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2014/02/episode-145-r-i-p-d/\">Episode #145 – R.I.P.D.</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2013/05/episode-126-playing-for-keeps/\">Episode #126 – Playing for Keeps</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2013/02/the-flop-house-episode-121-the-oogieloves-in-the-big-balloon-adventure/\">Episode #121 – The Oogieloves in the Big Balloon Adventure</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2010/04/episode-58-twilight-new-moon/\">Episode #58 – Twilight: New Moon</a></li>\n<li><a href=\"http://www.flophousepodcast.com/2009/06/the-flop-house-episode-40-friday-the-13th/\">Episode #40 – Friday the 13th</a></li>\n</ul>\n"
     } ,
 
     {
       "title"    : "Creating a new theme for Drupal Core",
       "url"     : "http://lewisnyman.co.uk/blog/creating-new-theme-drupal-core/",
       "date"     : "June 03, 2015",
       "content"  : "<p>A combination of residual jetlag and a <a href=\"/blog/jac-celebration-dinner/\">late night of celebration</a> resulted in another late start. Sorry team!</p>\n\n<p>After regaining a sense of productivity I proposed a session for DrupalCon Barcelona: <a href=\"https://events.drupal.org/barcelona2015/sessions/creating-new-theme-drupal-core\">Creating a new theme for Drupal Core.</a> Doesn&#39;t the site look lovely? Well done <a href=\"http://adcisolutions.com/\">ADCI.</a></p>\n\n<p>With Drupal 8 close to the door around Drupalcon, it feels like the right time to start discussing how we add freshly designed themes to Drupal Core. The benefits of bundled, general use theme are suspect. I can&#39;t help but look at the Wordpress community with some jealousy, <a href=\"https://wordpress.org/themes/twentyfifteen/\">releasing a new core theme every year.</a></p>\n\n<p>The default theme that ships with Drupal is an expression of  potential, it&#39;s an opportunity to show off what you can do with Drupal. We have <a href=\"https://www.drupal.org/drupal-8.0/themers\">overhauled</a> major parts of the theme system in Drupal 8. We should show off what we can do with it.</p>\n\n<p><a href=\"https://events.drupal.org/barcelona2015/sessions/creating-new-theme-drupal-core\">View the session here</a></p>\n"
     } ,
 
     {
       "title"    : "JAC celebration dinner",
       "url"     : "http://lewisnyman.co.uk/blog/jac-celebration-dinner/",
       "date"     : "June 02, 2015",
       "content"  : "<p>Last night was was a bad night for me, a good night for jetlag. I slept from 12am–3:30am.</p>\n\n<p>I&#39;m on the train back from London to Haywards Heath after a nice celebration dinner for the <a href=\"http://jac.judiciary.gov.uk\">JAC project.</a> We&#39;ve reached what we call the “end of the beginning” of the project and that means everyone involved, client and team, have a nice evening out to celebrate a job done.  I love how much emphasis we put into celebrating our achievements. It&#39;s a real morale booster when it&#39;s easy to loose track of all the good work that&#39;s done over the project.</p>\n"
     } ,
 
     {
       "title"    : "Tracking time with Harvest timers",
       "url"     : "http://lewisnyman.co.uk/blog/tracking-time-harvest-timers/",
       "date"     : "June 01, 2015",
       "content"  : "<p>Today I overslept for four hours! Jetlag is maybe the worst of the first world problems.</p>\n\n<p>Recently I started tracking my time more accurately using the <a href=\"https://www.getharvest.com/\">Harvest desktop app.</a> I used to input how long I worked on a certain project by the hour but I once I built the habit of starting/stopped timers I think I prefer it.</p>\n\n<p>If you work flexible hours, it makes you think about your time carefully, aware that you have a target of billable hours to hit. I&#39;ve found myself more focused, knowing that I should stop the timer if I&#39;m distracted by another task for too long.</p>\n"
     } ,
 
     {
       "title"    : "100 words",
       "url"     : "http://lewisnyman.co.uk/blog/100-words/",
       "date"     : "May 31, 2015",
       "content"  : "<p>Inspired by <a href=\"https://adactio.com/\">Jeremy,</a> I&#39;ve started the 100 words challenge. 100 words every day for 100 days. I&#39;m surprised how much I enjoyed reading Jeremy&#39;s daily slices of life.</p>\n\n<p>This is day two, and I&#39;m jetlagged with nothing else to write about, so I choose to write about the writing challenge. I don&#39;t really know what I&#39;m going to write about everyday but I guess that&#39;s part of the fun. I hope it&#39;s going to encourage me to work on this site a little more, as I start to use it often. I&#39;m using <a href=\"www.hemingwayapp.com\">Hemingway</a> to write these posts, it&#39;s handy!</p>\n"
     } ,
 
     {
       "title"    : "Three weeks in the USA",
       "url"     : "http://lewisnyman.co.uk/blog/three-weeks-in-the-usa/",
       "date"     : "May 30, 2015",
       "content"  : "<p>I&#39;m writing this flying from Austin to London. The past three weeks in the US has been amazing. Highlights include: Exploring the many faces of LA, flamingo and ostrich feeding, walking the Vegas strip, joshua tree under the stars, warming up pizza in a sun oven, spotting elk and chipmunks in the grand canyon, frozen margaritas, tacos, a shrimp boil, and tacos.</p>\n\n<p>Tacos.</p>\n\n<p>Thanks to everyone who made Emma and I feel welcome and super happy. I feel spoilt with kindness.</p>\n\n<p>In other news, the timing of this flight overlaps with the FA cup final! The suspense is killing me!</p>\n"
     } ,
 
     {
       "title"    : "Drupal 8 theming guide Q & A",
       "url"     : "http://lewisnyman.co.uk/blog/Drupal-8-theming-guide-qa/",
       "date"     : "May 29, 2015",
       "content"  : "<p><a href=\"http://www.sqndr.com/\">Sander</a> asked me to answer a few questions for his <a href=\"https://github.com/sqndr/d8-theming-guide/issues/17\">Drupal 8 theming guide</a>. It made sense to publish them here instead of including them in a Github comment.</p>\n\n<h2>What is your job as maintainer of the Seven theme?</h2>\n\n<p>The job of a core component maintainer is <a href=\"https://www.drupal.org/contribute/core-maintainers#component\">well documented.</a> My primary role is to keep an overview of all the issues in the <a href=\"https://www.drupal.org/project/issues/drupal?component=Seven+theme\">Seven queue.</a> There are very few people who have this kind of overview, so it&#39;s useful to be able to point someone in the right direction if they come to be asking if a bug has already been reported or if a discussion has already happened.</p>\n\n<p>I&#39;m also responsible for making sure the issues are in a organised and in a good state to work on. I also have enough experience to review all the patches for Seven, checking them for quality and consistency.</p>\n\n<h2>What are new features for the Seven theme in Drupal 8?</h2>\n\n<p>Seven&#39;s design has evolved in Drupal 8. <a href=\"https://www.drupal.org/u/ry5n\">Ry5n,</a> <a href=\"https://www.drupal.org/u/yoroy\">Yoroy,</a> and <a href=\"https://www.drupal.org/u/bojhan\">Bojhan</a> produced a style guide for which has improved the look-and-feel of the theme as well as providing a more stable and consistent base to make UX improvements across the many core modules.</p>\n\n<p>Some examples would be consistent use of different button types, dropbuttons, the new content creation layout, and the inline form errors.</p>\n\n<h2>What does the future for the Seven theme look like? Drupal 8.1 — or future Drupal 9? Are there any current plans?</h2>\n\n<p>Seven has slowly embraced component based design. Using the principles of the style guide and our <a href=\"https://www.drupal.org/coding-standards/css\">new CSS standards,</a> a lot of the CSS in Seven is now using more abstract, reuseable, CSS components. I imagine that Seven will expand on these UI components in the 8.x point releases to cover more varied situations that we require in core and contrib.</p>\n\n<p>In Drupal 9, well there&#39;s been <a href=\"https://events.drupal.org/losangeles2015/sessions/drupal-9-components-library-next-theme-system\">discussion on embracing component based design</a> throughout the whole of Drupal&#39;s theme system, not only the CSS.</p>\n\n<p>If this happens in Drupal 9, Seven will likely become the first test case for this system.</p>\n\n<p>We&#39;ve also talked about adding more animation and &quot;fanciness&quot; to Seven, now we are in a more stable position with the CSS. We also joke about adding sound to the UI, you never know!</p>\n\n<h2>Something we&#39;ve been talking about is the style guide for Drupal. Has there been any progress?</h2>\n\n<p>We ran into some maintenance problems with the <a href=\"https://groups.drupal.org/node/283223\">original photoshop style guide</a> it was a pain to keep it up to date when the design evolved during implementation and beyond.</p>\n\n<p>We&#39;ve had a plan in place for a while to <a href=\"https://www.drupal.org/node/2404111\">document Seven&#39;s CSS components using KSS</a>, which would be amazing as we could generate the style guide from core code, similar to the documentation on <a href=\"https://api.drupal.org\">api.drupal.org</a> and similar to the plans to <a href=\"https://www.drupal.org/node/2182153\">document Drupal core&#39;s Javascript.</a> We ran into a bit of a roadblock however, because the KSS syntax is quite different to Drupal&#39;s current commenting standards. There is still a lot of urgent work to do before Drupal 8 hits release candidate, which is when HTML and CSS changes are frozen, so this has taken a bit of a backseat for the time being.</p>\n\n<h2>Some people find the name very confusing. What about you? If you could pick a name, what would that name be?</h2>\n\n<p>Over the years I think I&#39;ve gone back and forth on the name. I think that a name is just a word that takes on the meaning we assign to it. Seven is the name of the administration theme that ships with Drupal, most people know that by now. Changing it now would invite more confusion.</p>\n\n<p>If we were creating it now and choosing a name, I would probably stick with Bartik&#39;s tradition of naming it after a famous person. Maybe after one of those adolescent ninja turtles.</p>\n\n<h2>What are the main challenges in building an administration theme for Drupal?</h2>\n\n<p>The biggest problem right now is the number of modules that require different user interfaces. Some modules make minor tweaks to the UI to meet their needs, some creating their own from scratch. It&#39;s very hard for an admin theme to support all these use cases without something breaking, let alone making the UX feel cohesive.</p>\n\n<p>My dream is to have no admin CSS in modules at all. My realistic aim is to have minimal CSS. I want to keep building Seven into a really useful UI framework, and to continue educating module developers on when they should use the components available to them to create a great, consistent UX.</p>\n"
     } ,
 
     {
       "title"    : 2014,
       "url"     : "http://lewisnyman.co.uk/blog/2014/",
       "date"     : "March 06, 2015",
       "content"  : "<p>I&#39;ve been looking forward to writing this retrospective on 2014. What a year! I couldn&#39;t of predicted what an eventful it has been. It&#39;s had a lot of ups and downs but it&#39;s all learning and growing at the end of it.</p>\n\n<p>It&#39;s easy to regret somethings I could of done better or done at all, but that&#39;s not the outlook on life I choose to have. We&#39;ve barely sat down this year, so it&#39;s better to celebrate the things we have done rather than the things we haven&#39;t.</p>\n\n<h2>Moving to Switzerland</h2>\n\n<p>This time last year moving to Zürich, Switzerland was on the cards. By the end of March we were out of our flat in Brighton and homeless in Zürich. We had sold most of our furniture and I threw away a lot of crap I owned that had built up since I moved out of my parents and started university.</p>\n\n<p>It felt great to finally get rid of stuff that just seemed to follow me around and I never used. It changed my mindset a little on what is valuable and I want to keep working on only owning things that are bringing me value.</p>\n\n<p>We were lucky to find a furnished flat early on. After nine months of living in Höngg I&#39;m eager to try somewhere a little more active and closer to the city.</p>\n\n<p>This year has been a busy year with a lot of distractions and barriers, but I don&#39;t feel like I&#39;ve lept into the swiss culture and made progress learning the language. At least not as much as I could of.</p>\n\n<p>I&#39;m curious to see how I will feel about Switzerland a year from now. I&#39;ve never moved to a country before, so now that I&#39;ve done it once and experienced it I can plan a little better on how to do it well. If I ever moved to a new country again I would plan well in advance so I could hit the ground running and make space in the year to learn and breathe. Bring on 2015 now.</p>\n\n<h2>Traveling</h2>\n\n<p>Too much! Too much travel. According to Tripit I took around 35 trips this year. Traveling to the UK on a occasionally is important, it helps us to work together well in a distributed team. The tough times were when business trip were close to conference trips. Instead of a few days away form Zürich it could easily become a whole week. Some months I felt like I was barely at home!</p>\n\n<p>A lot of that is down to lack of forward planning. In 2015 I&#39;m going to try and plan more and further to reduce strain.</p>\n\n<p>Having said that, I can&#39;t complain too much. I got a taste of many new countries, cultures, and cities.</p>\n\n<ul>\n<li>St. Moritz and the Glacier Express, Switzerland — January</li>\n<li><a href=\"http://szeged2014.drupaldays.org\">Budapest and Szeged, Hungary</a> — March</li>\n<li>Interlaken and the Alps, Switzerland — April</li>\n<li><a href=\"http://2014.drupalcamp.es\">Valencia, Spain</a> — May</li>\n<li><a href=\"https://austin2014.drupal.org\">Austin, Texas</a> — June</li>\n<li><a href=\"http://camp.drupalne.org\">Sunderland, UK</a> — July</li>\n<li><a href=\"http://hybridconf.net\">Stockholm, Sweden</a> — August</li>\n<li><a href=\"http://frontendunited.org\">Copenhagen, Denmark</a> — August</li>\n<li><a href=\"https://amsterdam2014.drupal.org\">Amsterdam, Holland</a> — September</li>\n<li>Lake Balaton, Hungary — August and October</li>\n<li>Inverness, UK — October</li>\n<li><a href=\"http://ghent2014.drupalcamp.be\">Brussels and Ghent, Belgium</a> — November</li>\n</ul>\n\n<p>I&#39;ve always thought that it&#39;s great for a career to drag you around the world. I&#39;m lucky to have the opportunity and support to do it so I should embrace. I do feel like I didn&#39;t spend enough time exploring the places I went to. It&#39;s a shame to go somewhere, spend all time indoors, and then leave.</p>\n\n<p>In 2015, I want to spend more time exploring, so I&#39;m aiming is to go to less places but spend more time exploring when I do travel. Columbia in February is going to be our first long holiday. Los Angeles and in May will be our second.</p>\n\n<h2>Working</h2>\n\n<p>What a great year it&#39;s been! I&#39;ve been working on one project for almost the entire year, and I&#39;m happy to say that it launched this month! Although I&#39;ve worked on projects with more reach and more users, this feels like the biggest project I&#39;ve worked on, because of the impact I feel like I&#39;ve had on the Judicial Appointment Commission and the difference that makes to the world.</p>\n\n<p>WunderRoot continues to grow in interesting ways. I love being able to work at a company where I can influence how it develops and the kind of company it grows into. As the clients and the UK team increase and diversify I think we&#39;re going to find it harder and harder to maintain our culture and keep everyone happy.</p>\n\n<h2>Writing</h2>\n\n<p>I think I wrote a lot this year, but not on this site. A lot of writing has the intention of pushing forward various community initiatives and they needed as wide a distribution as possible. I lot of the blog posts were either published on the Wunderkraut/WunderRoot site. I think I will go back and republish everything I&#39;ve written on this site, to prevent them being lost if any sites disappear in the future.</p>\n\n<ul>\n<li><a href=\"https://medium.com/@lewisnyman/we-need-more-modular-base-themes-f3fcf3ea893f\">We need more modular base themes</a></li>\n<li><a href=\"http://www.wunderroot.co.uk/blog/performance-design\">Performance by design</a></li>\n<li><a href=\"http://www.wunderroot.co.uk/blog/how-wunderroot-contributes-drupal-8\">How WunderRoot contributes to Drupal 8</a></li>\n<li><a href=\"http://www.wunderkraut.com/blog/healthy-sprinting/2014-07-25\">Healthy spriting</a></li>\n<li><a href=\"http://www.wunderkraut.com/blog/growing-drupal-8-contributors-at-wunderkraut/2014-11-21\">Growing Drupal 8 contributors at Wunderkraut</a></li>\n<li><a href=\"https://amsterdam2014.drupal.org/news/drupalcon-designers\">Drupalcon for designers</a></li>\n<li><a href=\"https://amsterdam2014.drupal.org/news/drupalcon-frontend-developers\">Drupalcon for frontend developers</a></li>\n</ul>\n\n<h2>Speaking</h2>\n\n<p>In my <a href=\"/blog/2013\">2013 retrospective</a> I wrote that, after a crazy year of speaking, I decided that I would speak no more than five times. This year I spoke four times, two of which were new talks. Sprinting at Drupal events continues to become more and more important so I prefer to have my focus there instead of worrying about my slides and getting enough practice in. In 2015 I&#39;ve already spoken twice... so let&#39;s see how that goes.</p>\n\n<ul>\n<li><a href=\"https://groups.drupal.org/node/448453\">Staying Classy: The story of the banana initiative</a></li>\n<li><a href=\"https://austin2014.drupal.org/session/drupal-design.html\">Drupal by design at Drupalcon Austin</a></li>\n<li><a href=\"http://frontendunited.org/session-info/everything-i%E2%80%99ve-learnt-designing-open-source-past-3-years-0\">Everything I&#39;ve learnt designing for open source in the past three years</a></li>\n<li><a href=\"\">Designing Drupal 8 at Drupalcamp Spain</a></li>\n</ul>\n\n<p>Ok so it took a little while longer to write this post than I thought, maybe that says a lot about how busy this year was.</p>\n"
     } ,
 
     {
       "title"    : "Roy Scholten Bootstrapping UX design in your open source project",
       "url"     : "http://lewisnyman.co.uk/blog/roy-scholten-bootstrappng-ux-open-source-project/",
       "date"     : "February 01, 2015",
       "content"  : "<p>At FOSDEM, <a href=\"https://twitter.com/royscholten\">Roy</a> shared his experiences on the Drupal project and his advice for anyone looking to increase UX design in their own project.</p>\n\n<h2>Why bother with UX?</h2>\n\n<ul>\n<li>It must be usable, if a user can&#39;t install it they can&#39;t tell if it&#39;s useful to them.</li>\n<li>Once they know, there are probably other products available, so you need to make your product delightful or desirable.</li>\n</ul>\n\n<h2>Drupal retrospective</h2>\n\n<h3>Drupal 6</h3>\n\n<ul>\n<li>Drupal was getting popular, there were many complaints that it was hard to use.</li>\n<li>Initiated two full blown usability tests.</li>\n<li>The results were disastrous. Even with a help desk to call, no one made it through.</li>\n<li>PANIC</li>\n<li>The community realised it had to do something about it.</li>\n</ul>\n\n<h3>Drupal 7</h3>\n\n<ul>\n<li>Dries blogged, critical UX issues, Drupal 7 is not getting released without it. Put UX in the spotlight.</li>\n<li>The community UX team was formed.</li>\n<li>The community struggled to make an impact, improvements were iterative.</li>\n<li>Two professional designers outside the community were hired by Acquia, to develop a grander vision for Drupal 7.</li>\n<li>They did design research, usability testing, developed a grander vision for Drupal 7. 80,000 euros for half a year were spent.</li>\n<li>Drupal 7 was lab tested, the critical usability issues were fixed.</li>\n</ul>\n\n<h3>Drupal 8</h3>\n\n<ul>\n<li>After the grander problems were fixed, we could focus on more specific efforts. For example the content creation form.</li>\n<li>Drupal is a large project, everyone has an opinion about design. Every design issue does not get committed under 100 comments.</li>\n<li>Codifying patterns and best practices, drawing up guidelines on how to implemented UI consistently.</li>\n<li>Moving towards smaller, more focused releases after Drupal 8.</li>\n</ul>\n\n<h2>Bootstrapping usability</h2>\n\n<h3>Usability tests</h3>\n\n<ul>\n<li>Avoid opinion based  discussions by using data.</li>\n<li>&quot;7/10 people struggled to complete this task, we have to change something&quot;</li>\n<li>Recorded usability tests show people the pain of users.</li>\n<li>Pre-Drupal 6 - the implementors of Drupal were also the users, the technical and user mental models were mixed.</li>\n<li>It sets a baseline, the next test will show you if you&#39;ve improved.</li>\n<li>Students who were involved in the project had access to a lab, the community UX test helped write the test script.</li>\n</ul>\n\n<h3>Reviews</h3>\n\n<ul>\n<li>Ask an interaction designer to review the UI, they can help prioritise problems.</li>\n<li>Be open to reviews</li>\n<li>Look at the support requests for common user problems</li>\n</ul>\n\n<h3>Build a design culture</h3>\n\n<ul>\n<li>The project lead has to champion the vision, for example, not releasing Drupal 7 until the UX issues were fixed</li>\n<li>Develop a design vision for the project, develop principles</li>\n<li>Set priorities, you have to make trade offs</li>\n<li>Allow for the design process to happen, adapt the tools and processes to help the designers.</li>\n</ul>\n\n<h4>Tools and processes</h4>\n\n<ul>\n<li>Create a design tag to make the design issues easy to find</li>\n<li>Post screen shots in issues, so it&#39;s easy for designers to review UI changes</li>\n</ul>\n\n<h4>Help Developers get better at design</h4>\n\n<ul>\n<li>Teach developers about learnability, efficiency and performances, memorability, safety, satisfaction.</li>\n</ul>\n\n<h3>Show the work</h3>\n\n<ul>\n<li>Document and publish usability studies and improvements and guidelines.</li>\n</ul>\n\n<h3>Attracting designers</h3>\n\n<ul>\n<li>Don&#39;t try and get many designers at once, one designer can make enough work for many developers!</li>\n<li>Try and make strong relationships with few designers</li>\n<li>Make a clear point of entry on your site for designers.</li>\n<li>Start with your own user base</li>\n</ul>\n"
     } ,
 
     {
       "title"    : "We need more modular base themes",
       "url"     : "http://lewisnyman.co.uk/blog/we-need-more-modular-base-themes/",
       "date"     : "October 18, 2014",
       "content"  : "<p>As long as I&#39;ve been working with Drupal there&#39;s always been a culture of <a href=\"https://www.drupal.org/node/323993\">base themes.</a> They are jumping off points for frontend developers or themers, maintained by the community.</p>\n\n<p>In theory this sounds very close to the open source culture within the Drupal community. Why repeat steps when you can just build on the shoulders and experience of others?</p>\n\n<p>But there&#39;s a big difference between base themes and Drupal modules. Base themes are broad in scope, they all aim to solve the workflow of Drupal theming. They encourage a tribal mentality. Everyone has their base theme of choice that aligns with their workflow. You&#39;re either right or you&#39;re wrong.</p>\n\n<p>This does not gel with the spirit of open source. Every base theme implements it&#39;s own solution to common frontend problems. They don&#39;t share or reuse code between different base themes.</p>\n\n<p>And what if your desired workflow doesn&#39;t fit with the selection of base themes available? What if you like the implementation of mobile meta tags in Omega but don&#39;t want all the grid nonsense? What if you like the cleanliness of Mothership but also Zen&#39;s sassyness?</p>\n\n<p>I tried maintaining my own base theme when I first start working with Drupal 6. It was a mashup of Basic and Zen if my memory serves me correctly. Of course I don&#39;t use it anymore, maintaining a base theme was a nightmare.</p>\n\n<p>So what choice do you have? One option is to roll your own, inline with your workflow. But the idea of everyone working in their own bubble doesn&#39;t sound open source at all.</p>\n\n<p>The other option is to pick the base theme that is close enough to your workflow. Embrace the maintainer&#39;s overly prescriptive idea of the perfect frontend workflow.</p>\n\n<p>This is not how the Drupal community usually works. You have a luxury of modules that you can combine and reuse together without conflict. If you want to use similar functionality together, you can package them in a distribution.</p>\n\n<p>This is the direction modern frontend development is heading. Loosely coupled components pulled together using <a href=\"http://bundler.io/\">Bundler,</a> <a href=\"https://www.npmjs.com/\">npm,</a> or <a href=\"http://bower.io/\">Bower.</a> You have a pattern that you want to use again but with minor differences? Create a <a href=\"https://yeoman.io/generators/official.html\">Yeoman generator.</a></p>\n\n<p>We need this mentality in the Drupal theming community. We need to build modular tools that are reusable instead of requiring you to buy into someone else&#39;s philosophy.</p>\n\n<p>Luckily, we are already seeing signs of base themes moving in this direction. The <a href=\"https://www.drupal.org/project/aurora\">Magic module</a> is a result of a collaboration between the maintainers of the <a href=\"https://www.drupal.org/project/aurora\">Aurora</a> and <a href=\"https://www.drupal.org/project/omega\">Omega 4.x</a> base themes. Instead of rewriting the same performance improvements in every base theme, why not share the code and improve them together.</p>\n\n<p>The Magic module is already showing signs of a broad scope, after all, who can control magic? No one. I do hope it maintains a modular architecture that allows me to choose the benefits for myself instead of requiring a big buy into the maintainer&#39;s vision.</p>\n\n<p>Maybe the concept of a base theme is flawed? I don&#39;t know. I&#39;d love to see more collaboration between base theme maintainers because at the end of the day it would benefit all of us.</p>\n"
     } ,
 
     {
       "title"    : "Reflections on freelancing",
       "url"     : "http://lewisnyman.co.uk/blog/reflections-on-freelancing/",
       "date"     : "October 10, 2014",
       "content"  : "<p>It&#39;s been about 10 months since I switched from freelancing to working back under a real organisation. I was freelancing for maybe a year and a half. Back in 2012 I had this to say:</p>\n\n<blockquote>I quit full-time employment and set up Lewis Nyman Design ltd. It took a leap of faith but I haven't looked back. The freedom suits me and I've been able to learn a lot more working together with so many smart people.</blockquote>\n\n<p>I was happy with the freedom and control I had after feeling stifled in full-time employment.</p>\n\n<p>But I also found contracting a little lonely. I&#39;d parachute into companies with close knit teams and ways of working. Everyone there knows you&#39;re a temporary resource, even though the best companies I worked with made me feel part of the team.</p>\n\n<p>You&#39;re hired to do a job, get on with it, and move on. I  struggled with the instinct to be bold and improve things I found that could be better. Sometimes changes are just not wanted, especially from the contractor who might not even be here tomorrow.</p>\n\n<p>I&#39;ve put faith in high standards and enthusiasm that have got me this far in my career, so keeping my head down feels very unnatural.</p>\n\n<p>Even though I enjoyed the financial freedom, I had a desire to find a team of people that I could trust and who trusted me. People with complementary skills sets to mine, that can fill in the areas I am weak, and respectfully challenge me.</p>\n\n<p>So when I met with <a href=\"http://www.steveparks.co.uk/\">Steve P</a> for a chat, I really wasn&#39;t sure what I wanted. To be honest I knew very little about WunderKraut before then. As it happened, everything he was aiming for aligned with mine.</p>\n\n<p>It took a leap of faith to jump into my own business, and it was a leap of faith to jump back out. I don&#39;t regret either decision. Objectives change over time with experiences and perspective.</p>\n"
     } ,
 
     {
       "title"    : 2013,
       "url"     : "http://lewisnyman.co.uk/blog/2013/",
       "date"     : "January 06, 2014",
       "content"  : "<p>Time for another customary annual round up post. If I still can&#39;t get around to blogging regularly then I owe myself at quick reflection once a year.</p>\n\n<p>2012 <a href=\"http://lewisnyman.co.uk/blog/2012\">was a big year</a> for me. I knew I had to make a big effort to outdo it. I also set myself a challenge to do more “quiet time” reading. I completely failed in that respect.</p>\n\n<p>Moving on...</p>\n\n<h2>Writing</h2>\n\n<p>I wrote very few articles this this past year! I don&#39;t feel ashamed admitting this, maybe that&#39;s part of the problem. I ended up being kept busy enough with other responsibilities and sometimes you just need to focus. I didn&#39;t have greatly positive experiences writing for the few popular online blogs I did write for in 2012. It doesn&#39;t promote a lot of confidence when an <a href=\"http://www.creativebloq.com/netmag/where-are-our-absolute-css-units-2126477\">article</a> you spent a lot of time on disappears without warning or explanation.</p>\n\n<p>I want to write a lot more in 2014. Rougher and quicker. Like this post.</p>\n\n<h2>Speaking</h2>\n\n<p>What a crazy year. <a href=\"https://twitter.com/justafish\">Sally Young</a> talked me into putting together a talk for the London <a href=\"http://www.meetup.com/Learning-Drupal-Meetup/events/102317202/\">Learning Drupal meeting</a> in February and it ended up forming the basis for many of the talks I gave that year. I spoke about Drupal 8 Design improvements at <a href=\"http://www.youtube.com/watch?v=_eMhSsuL8jw\">Drupalcamp London</a>, <a href=\"http://dublin2013.drupaldays.org/program/sessions/drupal-8-ui-changes\">Dev Days Dublin</a>, and <a href=\"https://prague2013.drupal.org/session/designing-drupal-8-0\">Drupalcon Prague</a>, I took the subject matter to a different level for my talk at <a href=\"http://camp2013.nwdrupal.org.uk/schedule\">Drupalcamp North West</a>. I also spoke about the challenges of introducing Responsive Web Design to an organisation at <a href=\"http://frontendunited.org/session-info/do-websites-dream-elastic-sheep-rwd-real-world\">Frontend United</a> which was ace because there were so many high quality talks and discussions.</p>\n\n<p>I had only spoken twice prior to 2013. I spent a lot of 2013 trying to find my comfort zone in preparation and presentation style. I started trying to be a bit more laid back and confident in my ability to wing it in places and maybe went a bit too far in that direction. Being asked to keynote Drupalcamp North West was a lot of pressure in a good way. It forced me to up my game and because of that it felt like the best talk I&#39;ve given so far.</p>\n\n<p>I also attended <a href=\"http://slideandstage.com\">Slide and Stage,</a> a presentation workshop by <a href=\"https://twitter.com/aral\">Aral Balkan</a>. It was so valuable to learn from a speaker with 10 years experience and holds himself to such a high professional standard.</p>\n\n<p>I spoke at 5 events in 2013. I think that&#39;s probably the sweet spot for me, if not one too many. I turned down a few opportunities to speak. I learnt that it&#39;s important to make each presentation you give “special” and give yourself enough breathing room to really spend time on it because you owe it to everyone sitting in the room spending their free time listening to you. I don&#39;t want it to feel like I&#39;m just <em>churning out</em> talks. If I had a target for this year it would be to speak at some more non-Drupal events. I feel less intimidated speaking to a Drupal crowd because I know how friendly and supportive the community is. I also now have other responsibilities at Drupal events, let&#39;s get to that in a bit.</p>\n\n<h2>Community</h2>\n\n<p>Last year I worked a lot on the <a href=\"http://groups.drupal.org/mobile/drupal-8\">Drupal 8 Mobile Initiative,</a> spending a lot of time designing a new experience for mobile users. Actually implementing this proved to be very difficult and became a big learning curve on working on a large open source project like Drupal core. As everything is issue based and modular, it&#39;s actually very difficult to implement global changes.</p>\n\n<p>Enter the <a href=\"https://groups.drupal.org/node/283223\">Seven Style Guide.</a> Turns out this is exactly what I was missing. It&#39;s much easier to re-design <em>every thing</em> instead of just redesigning the mobile experience. I threw a lot of time into getting this implemented (and still am) and I ended up taking responsibility <a href=\"http://lewisnyman.co.uk/blog/seven\">for the entire Seven theme.</a> I now spend a lot of time at Drupal events sprinting and mentoring wannabe front-end contributors. I love it.</p>\n\n<p>I&#39;ve also been working on getting the <a href=\"https://groups.drupal.org/node/313453\">Drupal.org theme open-sourced.</a> It sounds trivial but there are some tricky concerns to address. This would be a great achievement, one that I would be very proud of. This will happen.</p>\n\n<h2>Work</h2>\n\n<p>I did a lot of work for Comic Relief in 2013, helping them with <a href=\"www.rednoseday.com\">Rednoseday.com</a> and <a href=\"www.sportrelief.com\">Sportrelief.com</a> which are behemoths of sites with very complex requirements. I haven&#39;t really written much about contracting after doing it for about a year and a half, let&#39;s save that for another post. The short story is a I joined <a href=\"http://www.wunderroot.co.uk\">Wunderroot</a> as a full-time employee and I&#39;m very excited about what 2014 will bring working with them.</p>\n\n<h2>The rest</h2>\n\n<p>We moved from London to Brighton. I like Brighton, having grew up nearby it feels like a of a home town but with a lot of depth to explore.</p>\n\n<p>Having said that, I&#39;m very excited at the prospect of moving to Switzerland in 2014. Bring me that horizon!</p>\n"
     } ,
 
     {
       "title"    : "Hello Jekyll",
       "url"     : "http://lewisnyman.co.uk/blog/hello-jekyll/",
       "date"     : "January 03, 2014",
       "content"  : "<p class=\"intro\">Late last year I ported my personal site from Drupal to Jekyll. When I've mentioned this in passing to people I get odd looks.</p>\n\n<p>I&#39;m a <a href=\"/blog/seven\">Drupal 8 core maintainer</a> which means I spend a lot of time improving Drupal. I also get paid to work with Drupal but moving off of Drupal for my personal site wasn&#39;t a tough decision at all, it made perfect sense.</p>\n\n<p>Before I started at <a href=\"http://wunderroot.com\">WunderRoot</a> I had a nice chat over a pub lunch with one of the co-founders <a href=\"http://steveparks.co.uk\">Steve Parks</a>. He was telling me about the company&#39;s commitment to the “right tool for the job”, be that internal or recommendations for clients, despite being a largely Drupal-focused agency.</p>\n\n<p>He mentioned to me “We wouldn&#39;t use a project management tool built in Drupal, we&#39;d use the best project management tool available, like Jira. We wouldn&#39;t use Drupal to build an internal network, we&#39;d use the product for the job.”</p>\n\n<p>“I guess your blog is built in Wordpress then?” I joked. Surprisingly I learnt that this was a serious consideration at the time. I was also unaware that Steve has moved his personal site to <del>Wordpress</del> <a href=\"http://www.steveparks.co.uk/\">Jekyll</a> for similar reasons.</p>\n\n<p>Well informed, objective decisions impress me.</p>\n\n<p>In the coming days I kept thinking about this conversation. What benefits was I getting out of using Drupal for my own personal site an were they worth the cost? Let&#39;s look at my requirements:</p>\n\n<ol>\n<li>I care about HTML. Let&#39;s go into why another time. Good markup is good, agreed?</li>\n<li>I don&#39;t need a WYSIWYG to create content. I wrote all my posts in HTML.</li>\n<li>I don&#39;t have any complex data structures or requirements. The site is pretty minimal.</li>\n<li>I like having control over the front-end output, where assets are loaded, and when. This means I can optimise the front-end performance using modern techniques without worrying about breaking the framework.</li>\n<li>I don&#39;t know anything about server side performance. I was paying about £15 a month for <a href=\"https://www.getpantheon.com\">Pantheon hosting</a> just so I didn&#39;t have to worry about development workflow and caching and everything else that is out of my ballpark.</li>\n</ol>\n\n<p>Looking at this list objectively, Drupal looks like a terrible fit. I wasn&#39;t doing Drupal any favours by using it for a purpose it didn&#39;t suit and I wasn&#39;t doing myself any favours by wading through PHP and config screens <em>removing</em> redundant CSS and markup.</p>\n\n<p>Looking at this list objectively, a static site generator sounded right up my street. I&#39;d used <a href=\"http://middlemanapp.com\">Middleman</a> before and loved it but I was well aware of the ubiquitous nature of Jekyll and decided it was popular enough be worthing checking out. I also found a very tasty <a href=\"https://github.com/robwierzbowski/generator-jekyllrb\">Yeoman generator for Jekyll</a> which included a ton of Grunt tasks for Compass, instant local server with LiveReload, various lints, and concatenation and minification of all-the-things from the get go. What a great opportunity to learn new techniques!</p>\n\n<p>My Drupal theme was already built on Sass so moving that over was pretty easy. The <a href=\"https://github.com/jekyll/jekyll-import/blob/master/lib/jekyll-import/importers/drupal7.rb\">Drupal to Jekyll importer</a> was actually easier than I expected and worth using.</p>\n\n<p>Next up: hosting. I was looking for an opportunity to use Heroku but found it was too yak-shavey just to serve HTML files. Github was the next obvious option as it is free and has built in support for Jekyll. By this point I had a pretty beefy <code>grunt build</code> task and it didn&#39;t look like Github could support that so instead I ended up creating <a href=\"https://github.com/lewisnyman/lewisnyman.co.uk-source\">one repo for the source code</a> and another that actually <a href=\"https://github.com/lewisnyman/lewisnyman.github.io\">hosts the site</a>. I use the <a href=\"https://github.com/robwierzbowski/grunt-build-control\">Grunt build control task</a> to push the compiled and minified code to the hosting repo.</p>\n\n<h2>Results</h2>\n\n<p>The main reason for moving house to Jekyll was to ease development and gain a tighter control over front-end performance. While I was porting over it did give me a chance to make some improvements. Let&#39;s compare the old and the new <a href=\"/\">homepage</a> (excluding Google Analytics and Typekit).</p>\n\n<h3>HTML</h3>\n\n<ul>\n<li><strong>Old:</strong> — 2.6kb</li>\n<li><strong>New:</strong> — 1.0kb</li>\n</ul>\n\n<h3>CSS</h3>\n\n<ul>\n<li><strong>Old:</strong> — One request, 3.0kb</li>\n<li><strong>New:</strong> — One request, 1.8kb</li>\n</ul>\n\n<h3>Javascript</h3>\n\n<ul>\n<li><strong>Old:</strong> — Three requests, 43.6kb</li>\n<li><strong>New:</strong> — Two requests, 5.432kb</li>\n</ul>\n\n<p>I&#39;m not saying you couldn&#39;t get better results than this with Drupal but it is a lot harder to do so. I&#39;m pretty happy with having all the control in the front-end. There are still more improvements to make and I&#39;m looking forward to rolling out the next facets of the site design in 2014.</p>\n"
     } ,
 
     {
       "title"    : "Seven",
       "url"     : "http://lewisnyman.co.uk/blog/seven/",
       "date"     : "July 04, 2013",
       "content"  : "<p><a href=\"http://drupalcode.org/project/drupal.git/commit/884b84c1e3fb1c2198d559585b63ed19553dd33b\">Last week</a> I became the new maintainer for Drupal Core's administration theme; Seven. It's worth spending five minutes talking about what this means for Drupal, if not for your benefit than at least for my own.</p>\n\n<p>Drupal 8 is the first version of Drupal that I've ever contributed to and, as ‘backend developer’ isn't my job title, I've never maintained a contributed module.</p>\n\n<p>I learnt the ropes of open source contribution in the Drupal Core issue queue. I'm passionate about making great things that people use. I got pulled into making Drupal a great product because the community was so vibrant and active. I care about making Drupal better.</p>\n\n<p>This is very much new territory for me. This wasn't a role I was already doing and adding my name to 'MAINTAINERS.txt' just made it official. This was a role that no one was doing that we sorely needed. I had the opportunity to step up and ensure that we finish what we've started and make Drupal 8 — and beyond — a lot better for it. It was an easy decision.</p>\n\n<p>For the past week I've been learning and adjusting to this new role. I used to get a kick out of seeing my name next to a core commit (I still do), but now I get a kick out of seeing someone else's name under a commit, knowing I helped them get there.</p>\n\n<p>I've been tending to the untamed garden that is the Seven issue queue, as well as getting a really tight grip on the remaining work needed to implement the <a href=\"https://drupal.org/node/1986434\">new Seven Style Guide.</a> I'll talk more about that later but for now, <a href=\"https://drupal.org/sandbox/lewisnyman/2028997\">here's a sandbox</a> I whipped up with all the different style guide components merged together. </p>\n\n<p><p>If you want to help us make Drupal even better you know <a href=\"https://drupal.org/project/issues/drupal?component=Seven+theme\">where to find me.</a></p>\n"
     } ,
 
     {
       "title"    : "Using Pebble",
       "url"     : "http://lewisnyman.co.uk/blog/using-pebble/",
       "date"     : "May 10, 2013",
       "content"  : "<h2>Experiences and Opportunities</h2>\n\n<p>I&#39;m in the shower, reading incoming text messages. I&#39;m cycling downhill to the beach, skipping between tracks without taking my eye off the road. I&#39;m at dinner, I glance at the incoming call on my wrist, it&#39;s not important. I don&#39;t even break conversation.</p>\n\n<p>I&#39;ve been using Pebble for about a month now. It&#39;s been a daily enhancement to my social and working life, but it&#39;s also become a bit of an eye opener. It&#39;s making me think about all kinds of potential interactions using just a tiny screen and three buttons. The potential is huge.</p>\n\n<p>Let&#39;s be clear here, Pebble is a small enhancement to your lifestyle. It&#39;s not going to enable you do anything you couldn&#39;t do anything before, it&#39;s not the same as buying a new gadget. But that&#39;s the core strength of Pebble. It&#39;s a very dumb screen that communicates with a very smart phone, which means it&#39;s possibilities are as limitless as the depth of the app store you have available in your pocket.</p>\n\n<p>I&#39;ve found using Pebble to be surprisingly intuitive. It&#39;s a new method of interaction that&#39;s come naturally, thanks in part to the vibration motor. I&#39;ve never reached for my phone before glancing at my wrist whilst receiving an incoming call.</p>\n\n<p>At this moment there are a limited amount of smartphone apps that interact with Pebble. The bundled Pebble music app is simple, each of the three buttons is analogous to the previous, next, and pause controls you&#39;ll find when you double tap the lock screen on iOS. This means you can control any app playing sound in the background. This quickly became the only way I would want to interact with music. I&#39;ve started using a docked iPhone as a music centre at home more because I can control it from any room without breaking my current activity. All that&#39;s missing are volume controls, which I&#39;m told are incoming.</p>\n\n<p>The first iOS app to be released that integrates completely with Pebble is RunKeeper. As you&#39;d expect from a fitness app, it offers a live display of your run statistics along with controls to pause the tracking when you stop to stretch. I can&#39;t imagine having to check a low-contrast phone display to clock your pace. The E-ink display is perfect for this use case. Let&#39;s compare this Pebble-and-app combo to a fully fledged GPS enabled,wifi enabled, running watch. There&#39;s no reason to buy a gadget with expensive parts that you already own in another device when you could just buy the screen that talks to those expensive parts.</p>\n\n<p>I find myself having two methods of interaction through Pebble. The first is no interaction at all. There are certain apps that primarily offer a one way stream of communication with no user action required. Their usefulness is increased by having their notifications pushed to my wrist. Dark Sky notifies me when it&#39;s about to rain in my current location. Live Score Addict notifies me when important events happen in Premier League football matches. You look like a bit of a wizard if you quickly check your wrist and exclaim “Arsenal have scored” or suddenly pop out your umbrella.</p>\n\n<p>This has got me thinking. Which services can benefit from this one-way stream of communication? I&#39;ve been imagining a walking directions app that pushes the next instruction to your wrist based on your GPS location. How about an app that notifies you when your train is running late? Or an app that sends a vibration when you&#39;re speeding in an area with speed cameras. You don&#39;t need to interact with it, just receive the information and carry on.</p>\n\n<p>The other method of interaction is almost as limited. There are three buttons available for apps to use and that&#39;s by design. Three hardware buttons, three actions. I don&#39;t even look down, I know where the buttons are and what they&#39;re going to do. The music app is a great example of this.</p>\n\n<p>I think we&#39;re going to see the same mentality we started seeing once the iPhone was released, if it&#39;s possible for me to do the same task on a smaller screen, I would rather do it there compared to a less convenient device.</p>\n\n<p>Imagine standing on the underground whilst flicking through my recently arrived emails, archiving the unimportant ones. I&#39;d love an app where you go over your todo list for the day, each button corresponding to an action on that item. How about an that app that gives you just the headlines of new from the day? How many times have you clicked through to read a news article which could of been summed up in sentence or two? I&#39;d learn to love an app which forces me to take just enough information and move on with my day.</p>\n\n<p>We&#39;re in early adopters territory right now, we get to see all the production issues and mistaken assumptions but we also get to witness the birth of a new class of device, with the ability to mould the shape of things to come.</p>\n\n<p>We also have the opportunity to take this potential in directions we could never of imagined a year ago.</p>\n\n<p>Let&#39;s start making.</p>\n"
     } ,
 
     {
       "title"    : "Productivity",
       "url"     : "http://lewisnyman.co.uk/blog/productivity/",
       "date"     : "February 13, 2013",
       "content"  : "<p>This post is about the kind of productivity gains that I use every day without thinking. They&#39;ve become so entangled into how I use a Mac that I don&#39;t consider the to be separate from OSX. Whenever I start a new contract with new equipment I feel like a fish out of water, clunkily moving and cursing the unintuitive nature of the default interface. I&#39;m hoping I can give you some insight into how you can improve your productivity and maybe you can do the same for me.</p>\n\n<h2>Alfred</h2>\n\n<p>I&#39;m lost without <a href=\"http://www.alfredapp.com/\">Alfred.</a> Hitting alt+space and typing what I want is like breathing air. Alfred is a simple app launcher on the surface but it has <strong>depth.</strong> I commonly use it as a calculator, the bonus is that the result of your query is automatically copied to the clipboard. I use this all the time when converting fixed visual designs into responsive web designs.</p>\n\n<p>Alfred is completely customisable, you can write or <a href=\"http://support.alfredapp.com/extensions\">download</a> a ton of varied extensions although to be honest I haven&#39;t found many that are intuitive for me to type. Suggestions are welcome. You can also hook up your own custom keywords that output to a web search. Here&#39;s a sweet <a href=\"https://twitter.com/jongold/status/33844503236317184\">colour swatch tip from Jon Gold</a> that really kickstarted my interest in customising Alfred further.</p>\n\n<h2>TextExpander</h2>\n\n<p>I&#39;m a bit of a slow starter on <a href=\"http://smilesoftware.com/TextExpander/index.html\">TextExpander.</a> It&#39;s an amazingly simple but incredibly deep app that turns a small amount of key presses into a lot of characters. You can also set it up to paste from the clipboard or place the cursor in a custom position. I&#39;m nowhere near how I imagine a power user would use it but I do use it a ton for:</p>\n\n<ul>\n    <li>eml -> Primary email address</li>\n<li>hhome -> Street address </li>\n<li>ppost -> Post code</li>\n<li>mmob -> Mobile number</li>\n</ul>\n\n<p>There are a <a href=\"http://smilesoftware.com/TextExpander/snippets.html\">few libraries you can download.</a> Accented words and auto correction make you look less like a barbarian. The HTML and CSS libraries are extremely useful. Instead of opening and closing HTML tags you simple write a comma and the tag letters and TextExpander creates both opening and closing tags and moves your cursor in-between. Typing <q>,p</q> would create paragraph tags. Typing <q>,a</q> would create anchor tags, complete with the href attribute, waiting for you to paste a URL. I prefer having this system wide functionality instead of tying it to a specific program because it means I can use the muscle memory in any text area. I&#39;m using the HTML snippets to write this post in my CMS right now!</p>\n\n<p>Another great feature of TextExpander is it syncs using Dropbox. When your contracting and moving to different environments often, it&#39;s a life saver! Worth it.</p>\n\n<p>Find more TextExpander snippets from <a href=\"http://brettterpstra.com/projects/te-tools/\">Brett Terpstra</a> and <a href=\"http://www.43folders.com/2006/09/05/textexpander-review\">Merlin Mann.</a></p>\n\n<h2>BetterTouchTool</h2>\n\n<p><a href=\"http://www.boastr.de/\">BetterTouchTool</a> is awesome. It allows you to create your own gesture-activated actions for your Trackpad and Magic Mouse. It has a huge array of triggers with actions as varied as moving windows around, triggering system wide actions, and specific keyboard shortcuts. I use the <a href=\"http://blog.boastr.net/?p=596\">tiptap</a> gestures to snap windows to one half of the screen. When I&#39;m using multiple screens I use sideways swipes to shift windows from one screen to another.</p>\n\n<p>I&#39;ve also set up Mission Control and Individual App Expose on the Magic Mouse using two finger swipes. They mimic the Trackpad gestures closely so they don&#39;t require me to switch to a different mindset when I move between the two.</p>\n\n<p>I used to use a three finger upward swipe on the Trackpad to trigger CMD+W, which would allow me to close the currently open tab really quickly. I much prefer triggering Mission Control&trade; using that gesture and the odd time I accidentally triggered it annoyed me enough.</p>\n"
     } ,
 
     {
       "title"    : "Drupal Tales",
       "url"     : "http://lewisnyman.co.uk/blog/drupal-tales/",
       "date"     : "February 11, 2013",
       "content"  : "<blockquote>\nWhen we're all back behind our computers, and we're all little blue nicknames on the internet. Please remember this moment, when where we're all sitting together, we're all people, we're all human beings, we all really want Drupal to kick ass.</blockquote>\n\n<p><cite><a href=\"http://munich2012.drupal.org/program/sessions/drupal-8\">Angela Byron — Munich, 2012</a></cite></p>\n\n<p>I've made some great friends because of Drupal. I look forward to the once or twice a year at Drupalcon when I get a chance to sit opposite people from all over the world and really connect with them. Even when we're all in one place, we're all so busy that it's impossible to sit and have a deep conversation with all the people you want to.</p>\n\n<p>When we're all blue usernames behind a screen it's easy to forget every name is a real person with real lives and real emotions. I wish we could have these kind of connections more often, instead of once or twice a year.</p>\n\n<p>So that's why we're starting Drupal Tales, it's about <em>people</em> who work with Drupal. Intimate conversations about their life, their loves, their goals, their inspirations, and how working with Drupal has affected their lives.</p>\n\n<p>Sounds lovely doesn't it? Subscribe on <a href=\"http://drupaltales.com\">DrupalTales.com</a> and we'll let you know when we've got something for you. Drop <a href=\"https://twitter.com/lewisnyman\">myself</a> or <a href=\"https://twitter.com/emma_maria88\">Emma</a> a line and let us know what you think and what excites you.</p>\n"
     } ,
 
     {
       "title"    : 2012,
       "url"     : "http://lewisnyman.co.uk/blog/2012/",
       "date"     : "January 03, 2013",
       "content"  : "<p>The start of a new year is a cliche but it's a cliche for a reason. I think the opportunity to reflect, set your goals, and pull yourself towards them with new energy is powerful motivation.</p>\n\n<p>One of the goals I'm setting myself is to read more. I don't mean the kind of reading where you're standing up, stuck in a sweaty train carriage, and surrounded by thirty people breathing down your neck. I mean the kind of reading where you're sitting comfortably, it's peacefully quiet, and theres a hot drink within arms reach.</p>\n\n<p>One of my other goals is to write more, partly because I feel guilty setting up this site with the intention of pumping it full of content and I've ended up neglecting it. Partly because I enjoy it. What better way is there to start moving forward than by facing backwards and reflecting on the year that has been.</p>\n\n<p>2013, you have a tough act to follow.</p>\n\n<p>I like to think that every year I've had since leaving compulsory education has been an improvement on the last; the <q>Best Year Ever ™</q>. 2012 has been especially sweet, I'm really pleased the things I've learnt and achieved. I'm going to have to step it up a in 2013.</p>\n\n<h2>Writing</h2>\n\n<p>I wrote a fair few articles, including one published in  <a href=\"http://www.netmagazine.com/features/where-are-our-absolute-css-units\">.net magazine.</a> I also wrote a lot of posts supporting the mobile work I've been doing in Drupal, including <a href=\"http://drupalwatchdog.com/issue/toc/2/2\">one article printed on dead trees!</a> More on that later.</p>\n\n<h2>Speaking</h2>\n\n<p>Busy year! I presented three times in 2012. I hadn't spoken in front of a large crowd before so talking about Responsive Web Design in a packed out room on the first session slot of <a href=\"http://denver2012.drupal.org/\">Drupalcon Denver</a> was pretty intense. I also presented on Designing for Touch at <a href=\"http://2012.badcamp.net/program/mobile-summit\">BADcamp</a> which was tons of fun. I'm so grateful to <a href=\"https://twitter.com/eatings\">David Hwang</a> and <a href=\"https://twitter.com/jenlampton\">Jen Lampton</a> for dragging me out to California.</p>\n\n<h2>Community</h2>\n\n<p>Work continued on the <a href=\"http://groups.drupal.org/mobile/drupal-8\">Drupal 8 Mobile Initiative.</a> I spent a lot of free time iterating on prototypes based off the <a href=\"http://groups.drupal.org/node/191593\">design goals</a> and <a href=\"http://groups.drupal.org/node/172059\">usability testing. It culminated in <a href=\"http://groups.drupal.org/node/232653\">this call to action.</a> A lot of the design work I did lives on though the <a href=\"http://buytaert.net/spark-update-mobile-administration-in-drupal\">Drupal Spark Distribution</a> which is kicking butts left, right, and center.</p>\n\n<p>I've also contributed code that made its way into Drupal 8! Eleven issues impresses me anyway. I literally had no idea how to even begin to contribute code at the beginning of the year so I'm pleased I've learnt how to help out. Huge props to <a href=\"https://twitter.com/JohnAlbin\">John Albin</a> and <a href=\"https://twitter.com/adaptivethemes\">Jeff Burnz</a> who helped me on my way and gave me the confidence to try.</p>\n\n<p>I became heavily involved the initiative to port the Drupal.org theme to Drupal Seven, and while we were at it, making it a bit responsive. I flew out to a <a href=\"http://groups.drupal.org/node/223439\">sprint in Portland</a> to meet with <a href=\"https://twitter.com/rupl\">Rupl</a> and <a href=\"https://twitter.com/banghouse\">Banghouse</a> to get things sorted! We did a good job of working out what we needed to do and what we needed to do it, which manifested in <a href=\"http://groups.drupal.org/node/236988\">this post</a>. Hot debate rightly ensued and in the end <a href=\"http://groups.drupal.org/node/236988\"></a>we decided to go with the SASS grid framework Susy.</p>\n\n<p>I went to seven conferences in total this year including the fantastic <a href=\"http://2012.fromthefront.it/\">Treasure of Front-End Island,</a> <a href=\"http://2012.buildconf.com/\">Build,</a> and <a href=\"http://2012.newadventuresconf.com/\">New Adventures in Web Design.</a> <a href=\"http://munich2012.drupal.org/\">Drupalcon Munich</a> and <a href=\"http://www.badcamp.net/\">BADcamp</a> were also great because I got to hang out with so many friends.</p>\n\n<p>According to <a href=\"https://www.vizify.com/\">Vizify</a> my most popular tweet of the year was about <a href=\"https://www.vizify.com/lewis-nyman/year-on-twitter\">floppy disks and lassos.</a> I don't know if this is a useful metric but maybe I should consider writing a book on the subject.</p>\n\n<h2>Work</h2>\n\n<p>I quit full-time employment and set up Lewis Nyman Design ltd. It took a leap of faith but I haven't looked back. The freedom suits me and I've been able to learn a lot more working together with so many smart people.</p>\n\n<p>I started a business venture with two guys I'd never met before, and then subsequently left six months later. I'm not one for quitting and backing out was a tough decision to make. In the end it was the right decision and I hope the best for Jimmy and Stefan with Teamdeal.co. I've definitely learnt a lot about business and about myself that I'll be putting to good use in 2013.</p>\n\n<h2>The rest</h2>\n\n<p>I fell in love and moved in with my best friend :-)</p>\n\n<h2>So Far, So Good</h2>\n\n<p>I've a lot of work to do to make 2013 the best year ever. Time to start facing forward.</p>\n"
     } ,
 
     {
       "title"    : "Mobile vs Desktop is a lie",
       "url"     : "http://lewisnyman.co.uk/blog/mobile-vs-desktop-is-a-lie/",
       "date"     : "April 12, 2012",
       "content"  : "<p>Last week Jakob Nielsen published an article titled <a href=\"http://www.useit.com/alertbox/mobile-vs-full-sites.html\">Mobile vs Full Sites.</a> Some <a href=\"http://www.netmagazine.com/opinions/nielsen-wrong-mobile\">members of the web community</a> have already predicted that this is the point where Nielson has <a href=\"https://twitter.com/#!/arh/status/191196895371206656\">jumped the shark.</a></p>\n\n<p>Has Nielsen completely missed the point of Responsive Web Design? Yep.</p>\n\n<h3>A mobile what?</h3>\n\n<p>Jakob initially makes a sturdy point, an interface specifically tailored towards a specific environment or set of attributes is theoretically going serve the users purpose more than a general, unspecific interface. The actual reality hits once you try and define what the word \"mobile\" means.</p>\n\n<p>Are we talking about a mobile phone? Is it the ability to make calls what makes a mobile use case? Probably not.The iPod touch already demonstrates how different an iPhone would be if you removed the Phone application. Not very.</p>\n\n<p>As <a href=\"http://www.kylebean.co.uk/portfolio/#mobileevolution\">Kyle Beans excellent russian doll project</a> demonstrated, the definition of \"mobile phone\" has changed so many times in the past 20 years. I'm sure it's bound to change even more in the next 20.</p>\n\n<p>So what makes a mobile a mobile? No one really knows. They could have small screen, or they could not be. They could have a touch screen, <a href=\"www.flickr.com/photos/ivyfield/4667604500/\">or they could not be.</a> They could be on a slow network connection, <a href=\"http://www.flickr.com/photos/shanalines/4785508962/\">or they could not be.</a> They could be using a colour display, <a href=\"http://www.flickr.com/photos/alienratt/5580530063/\">or they could not be</a>. The rise of \"mobile\" devices has made it really obvious how broad and varied the web is. All our assumptions get thrown out the (1024 x 768) window.</p>\n\n<p>That's where Responsive Web Design excels.</p>\n\n<h3>Responsive Web Design: Embracing Flexibility</h3>\n\n<blockquote>\n    <p>The control which designers know in the print medium, and often desire in the web medium, is simply a function of the limitation of the printed page. We should embrace the fact that the web doesn’t have the same constraints, and design for this flexibility. But first, we must “accept the ebb and flow of things.” </p>\n    <address>\n        <cite>John Allsopp</cite>, “<a href=\"http://www.alistapart.com/articles/dao/\">A Dao of Web Design</a>”\n    </address>\n</blockquote>\n\n<p>That's the opening paragraph of <a href=\"http://www.alistapart.com/articles/responsive-web-design\" />Ethans article.</a> The whole philosophy is built around designing systems that respond to changing environments. We <em>should</em> embrace all the differences on the web, some of those differences may fall under the banner of \"mobile\" and some may not.</p>\n\n<p>I like to think of a static mobile design a storyboard or keyframe. The full or desktop site is another. There's a hell of a lot going on in between those two frames that we can't afford to ignore.</p>\n\n<p>If we pretend otherwise we are lying to ourselves</p>\n"
     } ,
 
     {
       "title"    : "Are we Approaching Responsive Images the Wrong Way?",
       "url"     : "http://lewisnyman.co.uk/blog/are-we-approaching-responsive-images-the-wrong-way/",
       "date"     : "April 05, 2012",
       "content"  : "<p>There's a lot of talk about responsive images right now. Some white knights in the web design community are rallying around this problem and fair play to them. It's a tough problem that needs solving. Responsive design is great in theory, but if we are forcing mobile users download ridiculous sized images and grinding their experience down to a halt who can blame some if they declare <a href=\"http://blog.cloudfour.com/css-media-query-for-mobile-is-fools-gold/\">separate mobile sites</a> to be the best solution?</p>\n\n<p>Our brightest hope for the future seems to be resting on the shoulders of the (currently fictional) <a href=\"http://www.w3.org/community/respimg/2012/03/07/14/\">&lt;picture&gt; element.</a> Here's the html set-up:</p>\n\n<pre><code>\n   &lt;picture alt=\"A giant stone face at The Bayon temple in Angkor Thom, Cambodia\"&gt;\n        &lt;source src=\"small.jpg\"&gt;\n        &lt;source src=\"medium.jpg\" media=\"(min-width: 400px)\"&gt;\n        &lt;source src=\"large.jpg\" media=\"(min-width: 800px)\"&gt;\n    &lt;/picture&gt;\n</code></pre>\n\n<p>Simple enough right? Any browser width below 400 pixels will get served small.jpg. Any browser width between 400-800 pixels will get medium.jpg. Everything else will get large.jpg. A simple and front-end solution no doubt. There are some drawbacks with this method though.</p>\n\n<h2>Rigid breakpoints</h2>\n\n<p>Remember a technique we called <a href=\"http://csswizardry.com/2011/01/forget-responsive-web-design/\">Adaptive Layouts?</a> Instead of using fluid, percentage based layouts it serves several fixed width layouts in pixels using media queries. Browser widths that fall <em>in between</em> each breakpoint would get an unoptimised layout, with space either side of the design.</p>\n\n<p>Doesn't this feel lot like our proposed solution for the &lt;picture&gt; element? Any browser width that falls in between each specified breakpoint would still load unused and wasted pixels. What if my device width was 401 pixels? Using the example code above it would load the full 800 pixel image. Let's not forget that is <em>per image</em> so it could be adding up to a lot of wasted bandwidth.</p>\n\n<p>Adaptive Layouts eventually receded, with the philosophy of Responsive Design advocating a design with layouts accessible to all kinds of devices, not just optimised for the devices you choose at the time of building.</p>\n\n<p>Rigid pre-defined breakpoints based on current devices... how much does this solution feel like that Adaptive Layouts again?</p>\n\n<h2>It does not scale</h2>\n\n<p>Let's imagine, in the future, that we might need to adapt to other factors in our images. Factors like colour. No point wasting bandwidth on rgb colour values right? How about factors like network speed? Even if the device has a large screen, is there any point loading a massive image on a slow connection? Maybe we want to load an aggressively compressed JPEG?</p>\n\n<p>Let's imagine the same code with just these two factors thrown in:</p>\n\n<pre><code>\n   &lt;picture alt=\"A giant stone face at The Bayon temple in Angkor Thom, Cambodia\"&gt;\n        &lt;source src=\"small_bw.jpg\"&gt;\n        &lt;source src=\"small_color.jpg\" media=\"(color)\"&gt;\n        &lt;source src=\"medium_bw.jpg\" media=\"(min-width: 400px)\"&gt;\n        &lt;source src=\"medium_bw_slow.jpg\" media=\"(min-width: 400px and network: &lt;= 3g)\"&gt;\n        &lt;source src=\"medium.jpg\" media=\"(min-width: 400px and color)\"&gt;\n        &lt;source src=\"medium_slow.jpg\" media=\"(min-width: 400px and color and network: &lt;= 3g)\"&gt;\n        &lt;source src=\"large_bw.jpg\" media=\"(min-width: 800px)\"&gt;\n        &lt;source src=\"large_bw_slow.jpg\" media=\"(min-width: 800px and network: &lt;= 3g)\"&gt;\n        &lt;source src=\"large.jpg\" media=\"(min-width: 800px and color)\"&gt;\n        &lt;source src=\"large_slow.jpg\" media=\"(min-width: 800px and color and network: &lt;= 3g)\"&gt;\n    &lt;/picture&gt;\n</code></pre>\n\n<p>A futuristic example but not an unrealistic one. These factors already exist and affect people browsing the web. Imagine if we added yet another factor into the mix, like very real and very scary ppi variations? We just doubled our mark-up again, each factor combination is also going to need a hi-res copy.</p>\n\n<h2>To hell and back</h2>\n\n<p>All I've done is point out two major problems with the current, proposed concept. I want this conversation to continue, not die. Here's my proposal:</p>\n\n<p>You know what's really good at handling complex logic and serving different types of content? Server side code. Programming code is very adept at handling complex logic with many variables. There are some very mature and robust image generators written in server side code that do all kinds of magic like dynamically resize, reformat, and modify. It's no surprise that the most <a href=\"http://www.sencha.com/learn/how-to-use-src-sencha-io/\">robust solution so far</a> takes advantage of dynamic image generation on the server.\n\n<p>An algorithm could dynamically resize to the exact size required by the device visiting the site without any extra work from developers or clients. Just upload the largest size you have and let the server scale it down. We could also conditionally convert the image to greyscale and increase compression if we need to. Again with no extra work from us. It scales like a dream.</p>\n\n<h2>What's the catch?</h2>\n\n<p>Of course there's a problem with all this! The problem with moving all this logic into the is context. The server needs  to know the variables involved to make these decisions. Variables like color support, screen size, network speed, and pixel density are available on the front-end through Javascript APIs.</p>\n\n<p>If we want this information to be available to  the server I see three options:</p>\n\n<ol>\n  <li>Write a cookie in Javascript to pass to the server. There are already <a href=\"http://tripleodeon.com/2010/10/modernizr-on-the-server-side/\">libraries that do this.</a></li>\n  <li>Use a user agent library like <a href=\"http://wurfl.sourceforge.net/\">WURFL</a> to map the UA string to device capabilities.</li>\n  <li>Pressure browser vendors to add more contextual information in a <a href=\"http://djce.org.uk/dumprequest\">http request.</a></li>\n</ol>\n\n<p>With this article I'm trying to do the third. Client requests already contain information servers use to serve different content. Let's just add a bit more. <q>I'd like this content please. Oh and by the way here's some useful information to help you find the right format for me.</p>\n\n<p>Is the server the holy grail? <a href=\"https://twitter.com/lewisnyman\">Let me know what you think.</a></p>\n"
     } ,
 
     {
       "title"    : "Choices, Choices, Choices",
       "url"     : "http://lewisnyman.co.uk/blog/choices-choices-choices/",
       "date"     : "October 14, 2010",
       "content"  : "<figure class=\"highlight\"><pre><code class=\"language-text\" data-lang=\"text\">&lt;p class=&quot;intro&quot;&gt;The year is 1997. Steve Jobs walks into a board room at 1 Infinity Loop, Cupertino, 12 years after he was fired from the company he co-founded. &lt;/p&gt;\n</code></pre></figure>\n\n<p class=\"intro\">He carries with him an <em>axe</em>.</p>\n\n<p>But don't panic. This is, or was, a metaphorical axe. At that time Apple's profits were sagging and their product line bloated. The Mac Performa, The Power Mac, The Apple Network Server, The Workgroup Server, The Powerbook, The eMate. Each with many numerical models making it nigh on impossible to decide which one you would spend your money on. You would need a spreadsheet decide on the model for you.</p>\n\n<p>Let's not forget Apple was also trying to flog several different displays, printers, mice and software solutions. One of the first things Jobs did on his return was cut down the product line into something comprehensible.</p>\n\n<p>Thirteen years later and the Mac product line stands at two, the iMac and the Mac Pro. The Macbook line stands at three. In thirteen years net profit has grown from -$1,045m to $5,704m. That's a steep ascent from the red into the clouds. This is no coincidence.</p>\n\n<p>People hate choice, despite what their brains tell them. </p>\n\n<blockquote><q>Freedom of choice is what you got, freedom from choice is what you want</q> <cite>Devo - 1980</cite></blockquote>\n\n<p>If you look close enough, you see this principle put to work in all areas of design from Apple. We should talk about that but first, let's talk about jam. </p>\n\n<h2>The Curious Case of the Case of Jam</h2>\n\n<p>In the year 2000 two university professors,  <a href=\"http://www.columbia.edu/%7Ess957/articles/Choice_is_Demotivating.pdf\">Sheena Lyengar and Mark Lepper conducted a study in a grocery store</a> in California, posing as store employees.</p>\n\n<p>They alternated between one table with 24 jars of jam to taste and one with six jars of jam. Not surprisingly, that bigger table drew the most visitors, 60% of passers-by stopped to have a taste compared to the 40% for the six jam table.</p>\n\n<p><q>What's the the interesting part?</q> Of all the people who stopped at the 24 jam stall, only 3% actually bought the jam. At the six jam table, <em>thirty percent</em> of all tasters walked out as proud owners of delicious jam. What's going on here?</p>\n\n<blockquote><q>Lots of choices will grab our attention, but too many choices overwhelm us – to the point where we likely won't buy at all.</q> <cite>Susan Weinschenk - Neuro Web Design</cite></blockquote>\n\n<h2>Back to Apple – Less is more?</h2>\n\n<p>Apple's iPhone gets constantly ripped by tech nerds for being inflexible and closed. Owners can do whatever they want as long as Apple says so, developers are becoming increasingly shackled as Apple enforces a <a href=\"http://www.apple.com/pr/library/2011/02/15appstore.html\">tighter grip on the app marketplace</a>. It's <a href=\"http://techcrunch.com/2011/02/15/apple-in-app-subscriptions/\">more then just money grabbing</a> though. With control they can ensure a consistent experience for the user. You only ever have to learn one interface for subscriptions. Great for users, bad for publishers.</p>\n\n<p>There is a reason they drip feed features into their phone, it's more important to have few features that are very good then many features that do a half job. the iPad is a perfect example of a product that is to be good at very few things but the experience of using it is sublime. Be known for quality not quantity.</p>\n\n<h2>Choices in web design</h2>\n\n<p>What does this have to do with web design? Do the same rules of human consciousness translate onto the web and can we use them to our advantage?</p>\n\n<p>Let me be clear. When I talk about psychology and taking 'advantage' I don't mean tricking people into buying dodgy products like a <a href=\"http://wiki.darkpatterns.org/\">dark arts</a> magician. It's about making informed choices about how to communicate to the user effectively. With the right information and know how you can help the user make effective choices and navigate throughout the site to their <a href=\"/articles/design-pursuit-happiness\">ultimate goal</a>, that's what interactive design is all about.</p>\n\n<h3>1. Reduce</h3>\n\n<p><a href=\"https://membership.thinkvitamin.com/subscribe/plans\"><img alt=\"The Think Vitamin sign up page\" src=\"/sites/lewisnyman.co.uk/files/imagecache/article_img/porto/Plans%20--%20Think%20Vitamin%20Membership.jpg\"></a>\n<p>Think long and hard about how many choices you present to your visitors. Is each item easily distinguishable from the others? Don&#39;t suffer from the same problems Apple faced before Jobs swung the axe.  <a href=\"http://thinkvitamin.com/\">Think Vitamin</a> just simplfied their price plans from three to two. The staff at Carsonified are well aware of the benefits of narrowing the focus of visitors and making their decision a 50/50 one.</p></p>\n\n<h3>2. Describe</h3>\n\n<p><a href=\"http://37signals.com/\"><img alt=\"The 37 Signals Front Page\" src=\"/sites/lewisnyman.co.uk/files/imagecache/article_img/porto/37signals.jpg\"></a>\n<p><a href=\"http://37signals.com/\">37 Signals</a> give you a small pitch initially. If the visitor is interested, they can gradually unpeel more and more information about a specific product. Very smart from a company with four major products.</p>\n\n<p><p>In order to choose if a product is suitable for them, people need to know just enough about the product. Don&#39;t overload them with information. Tell them what they can do. Don&#39;t them them how they can do it in till they ask.</p></p></p>\n\n<h3>3. Suggest</h3>\n\n<p><a href=\"https://typekit.com/plans\"><img alt=\"The Typekit pricing page\" src=\"/sites/lewisnyman.co.uk/files/imagecache/article_img/porto/typekit.jpg\"></a>\n<p>If you have a product or service that is far more popular then the others, let people know about it. <a href=\"http://ww.typekit.com\">Typekit</a> know who comes to their site, professional web designers are their bread and butter.</p></p>\n\n<h3>4. Get smart with defaults</h3>\n\n<p>Smart defaults are selections made for the user, often found in web forms.</p>\n\n<p>If it is possible, try and help your users make the correct decision to take some processing power out of their hands. You don't have to be right in every situation, just most of them. <a href=\"http://www.webdesignerdepot.com/2011/02/the-8020-rule-applied-to-web-design/\">Design for the 80%.</a></p>\n"
     } ,
 
     {
       "title"    : "Designing for 404",
       "url"     : "http://lewisnyman.co.uk/blog/designing-for-404/",
       "date"     : "September 10, 2010",
       "content"  : "<figure class=\"highlight\"><pre><code class=\"language-text\" data-lang=\"text\">&lt;p class=&quot;intro&quot;&gt;I&#39;ll forgive you if you don&#39;t know the meaning of 404.&lt;/p&gt;\n</code></pre></figure>\n\n<p>Why should you? Unless your a technical web architect that specific combination of numbers should never of crossed your path.</p>\n\n<p>But you probably do. A lot of people do.</p>\n\n<p>It's the server is throwing it's hands up in the air and saying <q>I'm so sorry! The page you were looking for does not exist, better luck next time.</q> Standard error pages don't give a lot of help to the user, creating a custom 404 pages for your site is deadly important and this is why.</p>\n\n<h2>The Importance of Damage Control</h2>\n\n<p>A lot of designers tend to focus on the nice side of web navigation, where everything is running smoothly. Visitors drop into your site, find what they want and scuttle off again with not one problem. It's not fun to design for when everything goes wrong but I think that's gotta be more important then the well traveled road.</p>\n\n<p>When a user hits any error, especially 404, this is red alert. They are split seconds away from closing the window and finding another source of information, products, work or what ever the purpose of your site is.</p>\n\n<p>You are literally <em>haemorrhaging</em> sales.</p>\n\n<p>You might not expect users to ever land on a missing page but no does, that's kind of the whole point.<br>\nSo 404 pages are pretty important right? How do you actually design a decent 404 page? </p>\n\n<p>I was just getting to that...</p>\n\n<h2>Lose the 404</h2>\n\n<p>Yeah I get it, <a title=\"501st 'page not found' page\" href=\"http://www.501st.com/404\">you're a nerd</a>.</p>\n\n<p>You know what 404 means, I guess you must be <a title=\"CMD 'Page not found' page\" href=\"http://www.colourmd.com/404/\">one</a> <a title=\"CSS Tricks 'Page not found' page\" href=\"http://css-tricks.com/thispagedoesntexist\">of</a> <a title=\"Home Star Runner 'Page not found' page\" href=\"http://www.homestarrunner.com/404\">the</a> <a title=\"Factor D Studio 'Page not found' page\" href=\"http://blog.factordstudio.com/404\">many</a> <a title=\"Brandstack 'Page not found' page\" href=\"http://brandstack.com/404\">people</a> alive in the <em>nineties</em> . Don't get me wrong, I'm glad you've taken the time to craft a custom page, it's a lot better then browser's default page. <a href=\"http://www.lewisnyman.co.uk/sites/lewisnyman.co.uk/files/porto/ie7-custom-404-page.png\">Or is it?</a></p>\n\n<p>No one should know what a 404 error means, as a user browsing your site I literally couldn't care less, all I care about is finding the content I want, thank you.</p>\n\n<h2>Keep it simple</h2>\n\n<p>Just like every other page, visitors are landing at this page with a purpose. A list of your recent tweet is not going to help me. Neither is a link to the webmaster's email, allowing users to inform you of a missing page, that's your job not theirs. Neither is a <a href=\"http://www.twingly.com/errors/404.html?aspxerrorpath=/404\">picture of a ninja,</a> surprisingly. </p>\n\n<p>And I definitely don't want to see any adverts, you lost to right to make money from my time when you failed to give me anything in return.</p>\n\n<h2>Give them smart options</h2>\n\n<p>Let's think about why the visitors are on the 404 page and how can we help them on their <a href=\"/articles/design-pursuit-happiness\">pursuit of happiness</a>. The primary navigation of the site is a good start, giving the user an outline of the structure of the site.</p>\n\n<p>Let's not stop there.</p>\n\n<p>How about search box? All the user needs to do it throw in what they were looking for and a list of results will be displayed for them in one click.</p>\n\n<p>We could go even further though.</p>\n\n<h2>Don't even have one</h2>\n\n<p>The user has probably already performed a search to get to your 404 page already right? Why they have to type in the same words again?<br>\nYou already have a clue about what they are looking for, up there in the url. On this site, if you enter on a missing page, the system grabs the words contained in the url and performs a search based on them.</p>\n\n<p>Give it a try: <a href=\"http://www.lewisnyman.co.uk/web\" title=\"http://www.lewisnyman.co.uk/web\">http://www.lewisnyman.co.uk/web</a></p>\n\n<p>Useful stuff right? We can even reduce the time and number of clicks to 0 if there's only one result. This site automatically redirects if there is only one result.</p>\n\n<p>Example: <a href=\"http://www.lewisnyman.co.uk/designing/404\" title=\"http://www.lewisnyman.co.uk/designing/404\">http://www.lewisnyman.co.uk/designing/404</a></p>\n\n<p>That's the ultimate damage control, not only does the user not have to deal with the extra baggage of '404', they didn't even know there was a problem.</p>\n\n<p>If you're out there running <a href=\"http://www.drupal.org\">Drupal,</a> you can add this functionality in minutes with the <a href=\"http://drupal.org/project/search404\">Search 404</a> module.</p>\n\n<h2>Sites that get it right</h2>\n\n<p>If you're looking for some more ideas, here are a list of sites that handle 'page not found' errors really well.</p>\n\n<p><a href=\"http://vimeo.com/404.html\"><img src=\"http://www.lewisnyman.co.uk/sites/lewisnyman.co.uk/files/imagecache/article_img/porto/vimeo_404.jpg\" alt=\"Vimeo 404\"></a></p>\n\n<p><a href=\"http://www.mozilla.com/en-US/404\"><img src=\"http://www.lewisnyman.co.uk/sites/lewisnyman.co.uk/files/imagecache/article_img/porto/mozilla_404.jpg\" alt=\"Mozilla 404\"></a></p>\n\n<p><a href=\"http://www.realmacsoftware.com/rapidweaver/overview/404\"><img src=\"http://www.lewisnyman.co.uk/sites/lewisnyman.co.uk/files/imagecache/article_img/porto/realmac_404.jpg\" alt=\"Real Mac 404\"></a></p>\n"
     } ,
 
     {
       "title"    : "Design & the Pursuit of Happiness",
       "url"     : "http://lewisnyman.co.uk/blog/design-and-the-pursuit-of-happiness/",
       "date"     : "August 26, 2010",
       "content"  : "<figure class=\"highlight\"><pre><code class=\"language-text\" data-lang=\"text\">&lt;p class=&quot;intro&quot;&gt;I am one of your users. I&#39;m on your website right now. &lt;/p&gt;\n</code></pre></figure>\n\n<p class=\"intro\">Can you tell me why?</p>\n\n<p>The internet is a multi-tool for life, people use it to pay their bills, communicate with friends and family, find employment, the list goes on and on.</p>\n\n<p>I'm shopping on Amazon for a book that will expand my knowledge base and make me a better designer. This will make me happy.</p>\n\n<p>I'm organising a get together with some old friends on Facebook. This will make me happy.</p>\n\n<p>I'm paying off my credit card statements on Halifax so I can eventually remove the grey cloud lurking over my head. This will make me happy.</p>\n\n<p>Every visitor to a website is on one thing, the <strong>Pursuit of Happiness</strong>.<br>\nSo can you tell me why visitors are coming to your site?<br>\nare your designs helping them achieve their goal or hindering them?</p>\n\n<p>For every addition you make you need to ask yourself <q>Is this going to help my users on the pursuit of happiness or is it a speedbump?</q></p>\n\n<blockquote><p><q>If you're not solving a problem you're invariably going to create one.</q> <cite>Eric Reiss</cite></p></blockquote>\n\n<p>It's safe to assume that you're here to read an article, above and below this you see more article. To the east and the west there is a pattern, unique to this article, that I hope communicates the content visually.<br>\nI hope from the split second you land on the page, without even reading a word, you have <em>some</em> idea what the article is about.</p>\n\n<p>Would the date of the post help you decide if you want to read it?<br>\nWould a <q><em>Tweet This!</em></q> button?<br>\nWould a list of articles you didn't come here to read?</p>\n\n<p>Probably not.</p>\n\n<p>I am still considering whether I need a navigation bar at the top of this page at all.</p>\n\n<blockquote><p><q>I'm on the pursuit of happiness and I know everything that shine ain't always gonna be gold</q> <cite>Kid Cudi</cite></p></blockquote>\n\n<p>Let's pretend for a second that what I want you to do and what you want to do are different things. Ideally I want you to read the article, post some feedback, share it with your friends and check out the rest of the site.<br>\nMaybe if I was more entrepreneurial I would throw a few advertisements in to pay for the cost of hosting the site.</p>\n\n<p>But you are only here one thing, to read the article and leave.<br>\nMaybe then you feel happy and content.</p>\n\n<p>I could try and influence your path through the site using brightly coloured buttons, pictures and sexy animation. Is that stimulating my pursuit of happiness or yours? The best I can do is help you on your way.</p>\n\n<p>Chauffeur you through the article with smart typography and few distractions then wave you on your way when we reach our final destination.</p>\n\n<p>Then, maybe you'll leave happy. You might even want to pass the happiness on to your friends.</p>\n  \n"
     } 
 
]
